

// ScriptStruct Gameplay.ClientCircleFlow
// 0x0128
struct FClientCircleFlow
{
	int64_t                                            ClientStartTime;                                          // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<int>                                        MrpcsFlow;                                                // 0x0008(0x0010) (ZeroConstructor)
	struct FString                                     PicUrl;                                                   // 0x0018(0x0010) (ZeroConstructor)
	uint32_t                                           GameStartTime;                                            // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           NewCircleBornTime;                                        // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NewCirclePositionX;                                       // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NewCirclePositionY;                                       // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NewCirclePositionRadius;                                  // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                NewCircleCount;                                           // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerPositionX;                                          // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerPositionY;                                          // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerPositionZ;                                          // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerHP;                                                 // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           OldCircleMoveTime;                                        // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           OldCircleMoveEndTime;                                     // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           PlayerOutTime;                                            // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CirclePoisonCount;                                        // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CirclePoisonMin;                                          // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CirclePoisonMax;                                          // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CirclePoisonAvg;                                          // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CirclePoisonTotal;                                        // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CirclePoisonDrop;                                         // 0x0070(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CirclePoisonDead;                                         // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RecoveryCount;                                            // 0x0078(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RecoveryMin;                                              // 0x007C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RecoveryMax;                                              // 0x0080(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                RecoveryTotal;                                            // 0x0084(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                EnergyRecoveryCount;                                      // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                EnergyRecoveryMin;                                        // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                EnergyRecoveryMax;                                        // 0x0090(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                EnergyRecoveryTotal;                                      // 0x0094(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                EnergyStartLv;                                            // 0x0098(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                EnergyStartTime;                                          // 0x009C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FString                                     EnergyItemUse;                                            // 0x00A0(0x0010) (ZeroConstructor)
	int                                                EnergyLvTimeInfo;                                         // 0x00B0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00B4(0x0004) MISSED OFFSET
	struct FString                                     EnergyRunFastTime;                                        // 0x00B8(0x0010) (ZeroConstructor)
	struct FString                                     EnergyRecoveryLvTimeInfo;                                 // 0x00C8(0x0010) (ZeroConstructor)
	int                                                EnergyEndLv;                                              // 0x00D8(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                EnergyEndTime;                                            // 0x00DC(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerMoveDis;                                            // 0x00E0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerSpeedMax;                                           // 0x00E4(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerSpeedAvg;                                           // 0x00E8(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerCarSpeedMax;                                        // 0x00EC(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerCarSpeedAvg;                                        // 0x00F0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerSquatMoveDis;                                       // 0x00F4(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerSquatMoveTime;                                      // 0x00F8(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerCreepMoveDis;                                       // 0x00FC(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerCreepMoveTime;                                      // 0x0100(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerRunMoveDis;                                         // 0x0104(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerRunMoveTime;                                        // 0x0108(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerDriveMoveDis;                                       // 0x010C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerDriveMoveTime;                                      // 0x0110(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerCar;                                                // 0x0114(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PlayerCameraDistanceMax;                                  // 0x0118(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           SecCircleFlowID;                                          // 0x011C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      AutoAimType;                                              // 0x0120(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0121(0x0003) MISSED OFFSET
	int                                                AutoAimTime;                                              // 0x0124(0x0004) (ZeroConstructor, IsPlainOldData)
};

