

// Class ShadowTrackerExtra.LobbyHUD
// //Class ShadowTrackerExtra.LobbyHUD
//0x0430 (0x0A40 - 0x0610)
class ALobbyHUD : public ATslBaseHUD
{
public:
	unsigned char                                      bResetRotation : 1;                                       // 0x0610(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0611(0x0003) MISSED OFFSET
	float                                              ResetStartTime;                                           // 0x0614(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	class ASTExtraWeapon*                              LobbyWeapon;                                              // 0x0618(0x0008) (ZeroConstructor, IsPlainOldData)
	class ASTExtraWeapon*                              CurrentWeapon;                                            // 0x0620(0x0008) (ZeroConstructor, IsPlainOldData)
	class ALobbyVehicle*                               LobbyVehicle;                                             // 0x0628(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnShowCurtain;                                            // 0x0630(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnHideCurtain;                                            // 0x0640(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0650(0x0008) MISSED OFFSET
	struct FAvatarCostumeData                          TestCostumeData;                                          // 0x0658(0x0030) (Edit)
	struct FScriptMulticastDelegate                    OnRequestSystemMenu;                                      // 0x0688(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0698(0x0010) MISSED OFFSET
	class UCurveFloat*                                 CameraTransitionCurve;                                    // 0x06A8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CameraTransitionElapsedTime;                              // 0x06B0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsCameraTransitionPlaying : 1;                           // 0x06B4(0x0001) (ZeroConstructor, IsPlainOldData)
	ELobbyCameraStates                                 LastCameraState;                                          // 0x06B5(0x0001) (ZeroConstructor, IsPlainOldData)
	ELobbyCameraStates                                 FromCameraState;                                          // 0x06B6(0x0001) (ZeroConstructor, IsPlainOldData)
	ELobbyCameraStates                                 ToCameraState;                                            // 0x06B7(0x0001) (ZeroConstructor, IsPlainOldData)
	TMap<int, class ACameraActor*>                     LobbyCameras;                                             // 0x06B8(0x0050) (ZeroConstructor)
	struct FName                                       MainMenuStreamingLevelName;                               // 0x0708(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FName                                       CustomizationStreamingLevelName;                          // 0x0710(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FTransform>                          CachedLobbyCharacterTransforms;                           // 0x0718(0x0010) (ZeroConstructor)
	unsigned char                                      bIsInCustomizationScene : 1;                              // 0x0728(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0729(0x0007) MISSED OFFSET
	class AActor*                                      ViewModeStudioClass;                                      // 0x0730(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       CameraSocketName;                                         // 0x0738(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ViewModeInterpSpeed;                                      // 0x0740(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x0744(0x0004) MISSED OFFSET
	class AViewModeStudio*                             ViewModeStudio;                                           // 0x0748(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      ViewModeActor;                                            // 0x0750(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      ViewModeActor_Character;                                  // 0x0758(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UMeshComponent*                              VIewModeMeshCom;                                          // 0x0760(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	EViewModeCategory                                  LastViewModeCategory;                                     // 0x0768(0x0001) (ZeroConstructor, IsPlainOldData)
	ELobbyCharacterCameraType                          LastLobbyCharacterCameraType;                             // 0x0769(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x6];                                       // 0x076A(0x0006) MISSED OFFSET
	class AActor*                                      CachedViewModePivot;                                      // 0x0770(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FRotator                                    ViewModeCurrentRotation;                                  // 0x0778(0x000C) (Transient, IsPlainOldData)
	struct FRotator                                    ViewModeTargetRotation;                                   // 0x0784(0x000C) (Transient, IsPlainOldData)
	float                                              ViewModeCurrentScale;                                     // 0x0790(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              ViewModeTargetScale;                                      // 0x0794(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FLightingChannels                           ViewModeLightingChannels;                                 // 0x0798(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0799(0x0003) MISSED OFFSET
	struct FFloatInterval                              ViewModeScaleRange;                                       // 0x079C(0x0008) (Edit, EditConst)
	float                                              MaxRotationValue;                                         // 0x07A4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ComputeValue;                                             // 0x07A8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsRotationInputReceive : 1;                              // 0x07AC(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x07AD(0x0003) MISSED OFFSET
	TArray<struct FString>                             TeamNickNames;                                            // 0x07B0(0x0010) (ZeroConstructor)
	int                                                HostSlotIndex;                                            // 0x07C0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x07C4(0x0004) MISSED OFFSET
	class UCurveFloat*                                 FadeInOutCurve;                                           // 0x07C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FadeInOutEffectElapsedTime;                               // 0x07D0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsFadeInOutEffectPlaying : 1;                            // 0x07D4(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x07D5(0x0003) MISSED OFFSET
	struct FTimerHandle                                TimerHandle_FadeInOut;                                    // 0x07D8(0x0008)
	float                                              CachedDOFFarBlueSize;                                     // 0x07E0(0x0004) (ZeroConstructor, IsPlainOldData)
	ELobbyBlurChangingStates                           BlurChangingState;                                        // 0x07E4(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bInitCameraTransition : 1;                                // 0x07E5(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x2];                                       // 0x07E6(0x0002) MISSED OFFSET
	int                                                RollbackStreamingBoost;                                   // 0x07E8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData11[0x4];                                       // 0x07EC(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCreateCharacter;                                        // 0x07F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDestroyCharacter;                                       // 0x0800(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnHostChanged;                                            // 0x0810(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FString                                     StartURL;                                                 // 0x0820(0x0010) (Edit, ZeroConstructor)
	TArray<class UCoherentCommonBinder*>               CommonBinders;                                            // 0x0830(0x0010) (ZeroConstructor, Transient)
	class UAkComponent*                                AkSound;                                                  // 0x0840(0x0008) (Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UAkComponent*                                VoiceAkSound;                                             // 0x0848(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TMap<int, class UAkComponent*>                     VoiceMap;                                                 // 0x0850(0x0050) (ExportObject, ZeroConstructor)
	class ACameraActor*                                MainCamera;                                               // 0x08A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData12[0x20];                                      // 0x08A8(0x0020) MISSED OFFSET
	unsigned char                                      UnknownData13[0x28];                                      // 0x08A8(0x0028) UNKNOWN PROPERTY: SoftClassProperty ShadowTrackerExtra.LobbyHUD.LobbyCharacterClass
	TMap<uint32_t, class ALobbyCharacter*>             LobbyCharacters;                                          // 0x08F0(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData14[0x50];                                      // 0x0940(0x0050) MISSED OFFSET
	unsigned char                                      bSaveIsGenderMale : 1;                                    // 0x0990(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData15[0x3];                                       // 0x0991(0x0003) MISSED OFFSET
	struct FViewTargetTransitionParams                 ViewTargetTransitionParams;                               // 0x0994(0x0010) (Edit)
	unsigned char                                      bSaveBlur : 1;                                            // 0x09A4(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData16[0x3];                                       // 0x09A5(0x0003) MISSED OFFSET
	class ULobbySceneManagerComponent*                 LobbySceneManagerComponent;                               // 0x09A8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData17[0x50];                                      // 0x09B0(0x0050) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCameraTransitionSolo;                                   // 0x0A00(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCameraTransitionCustomApperance;                        // 0x0A10(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCameraTransitionCustomWardrobe;                         // 0x0A20(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      IsBackpack : 1;                                           // 0x0A30(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData18[0xF];                                       // 0x0A31(0x000F) MISSED OFFSET

	// Function ShadowTrackerExtra.LobbyHUD.UpdateVoiceState
	// (Final, Native, Private, BlueprintCallable)
	void UpdateVoiceState(const struct FString& InUserIDint InVoiceState);// sub_FB1660()

	// Function ShadowTrackerExtra.LobbyHUD.UpdateStatTrak
	// (Final, Exec, Native, Private)
	void UpdateStatTrak(uint32_t Valueint NumKills);// sub_6CB760()

	// Function ShadowTrackerExtra.LobbyHUD.ToggleWindowModeTemporary
	// (Final, Exec, Native, Public)
	void ToggleWindowModeTemporary(unsigned char bNeedRecover);// sub_FB15D0()

	// Function ShadowTrackerExtra.LobbyHUD.Timeout_CheckConectingLobby
	// (Final, Native, Public)
	void Timeout_CheckConectingLobby();// sub_FB15B0()

	// Function ShadowTrackerExtra.LobbyHUD.TickFadeInOutEffect
	// (Final, Native, Private)
	void TickFadeInOutEffect(float DeltaTime);// sub_FB1530()

	// Function ShadowTrackerExtra.LobbyHUD.TickCameraTransition
	// (Final, Native, Private)
