

// Class ShadowTrackerExtra.STExtraPlayerController
// //Class ShadowTrackerExtra.STExtraPlayerController
//0x1A28 (0x2360 - 0x0938)
class ASTExtraPlayerController : public AUAEPlayerController
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0938(0x0018) MISSED OFFSET
	float                                              CanMoveCDTime;                                            // 0x0950(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7C];                                      // 0x0954(0x007C) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerExitFlying;                                       // 0x09D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bMoveable : 1;                                            // 0x09E0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x09E1(0x0007) MISSED OFFSET
	struct FString                                     FollowCandidateName;                                      // 0x09E8(0x0010) (BlueprintVisible, ZeroConstructor)
	struct FScriptMulticastDelegate                    triggerShotVoiceCheckDelegate;                            // 0x09F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              DoubleClickCancelDistanceThreshold;                       // 0x0A08(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RescueTotalSeconds;                                       // 0x0A0C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UPlayerControllerState*                      PlayerControllerStateFinished;                            // 0x0A10(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              CurrentCameraFOV;                                         // 0x0A18(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              TouchForceFireThreshold;                                  // 0x0A1C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EAutoAimType>                          AutoAimType;                                              // 0x0A20(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bNotMoveFire : 1;                                         // 0x0A21(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x0A22(0x0002) MISSED OFFSET
	float                                              DefaultCameraFOV;                                         // 0x0A24(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              DoubleClickFireDistanceThreshold;                         // 0x0A28(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              InputTouchRepeatLastTime;                                 // 0x0A2C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x0A30(0x0004) MISSED OFFSET
	float                                              AutoSprintBtnTime;                                        // 0x0A34(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<class ASTExtraVehicleBase*>                 nowNearBlowVehicleList;                                   // 0x0A38(0x0010) (ZeroConstructor)
	struct FString                                     GameTipParam2;                                            // 0x0A48(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      UnknownData05[0x48];                                      // 0x0A58(0x0048) MISSED OFFSET
	unsigned char                                      bLandAfterJumpPlane : 1;                                  // 0x0AA0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06 : 8;                                        // 0x0AA1(0x0001)
	unsigned char                                      bIsTrainingMode : 1;                                      // 0x0AA1(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0xE];                                       // 0x0AA2(0x000E) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnReleaseFireBtn;                                         // 0x0AB0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData08[0x31];                                      // 0x0AC0(0x0031) MISSED OFFSET
	unsigned char                                      bIsAutoAimOnlyInTouch : 1;                                // 0x0AF1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x2];                                       // 0x0AF2(0x0002) MISSED OFFSET
	struct FVector2D                                   CurFreeCamPosition;                                       // 0x0AF4(0x0008) (IsPlainOldData)
	unsigned char                                      bHasInitUIFinished : 1;                                   // 0x0AFC(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10 : 8;                                        // 0x0AFD(0x0001)
	unsigned char                                      isShowVaultEnable : 1;                                    // 0x0AFD(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x2];                                       // 0x0AFE(0x0002) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnSwitchCameraModeStart;                                  // 0x0B00(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayerCannotJump;                                       // 0x0B10(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData12[0x4];                                       // 0x0B20(0x0004) MISSED OFFSET
	float                                              Mobile_CameraMoveAdjustSensitiveValue;                    // 0x0B24(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnChangeBattleOwnerDel;                                   // 0x0B28(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bMoveablePickup : 1;                                      // 0x0B38(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x3];                                       // 0x0B39(0x0003) MISSED OFFSET
	float                                              FreeCamera_FPP_PITCH_MAX_LIMITED;                         // 0x0B3C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnPlayerPutDownAllProp;                                   // 0x0B40(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      IsPlayerUnableToDoAutoSprintOperation : 1;                // 0x0B50(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData14[0x3];                                       // 0x0B51(0x0003) MISSED OFFSET
	float                                              NoRespondArea;                                            // 0x0B54(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FreeCameraSPL_Hor_Parachute;                              // 0x0B58(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0x4];                                       // 0x0B5C(0x0004) MISSED OFFSET
	class UPlayerControllerState*                      PlayerControllerStateJumping;                             // 0x0B60(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      bUseTouchForce : 1;                                       // 0x0B68(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData16[0x87];                                      // 0x0B69(0x0087) MISSED OFFSET
	float                                              FreeViewUpRate;                                           // 0x0BF0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData17[0x4];                                       // 0x0BF4(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnRepTeammateChange;                                      // 0x0BF8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              FreeCameraSPL_Hor;                                        // 0x0C08(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData18[0x14];                                      // 0x0C0C(0x0014) MISSED OFFSET
	unsigned char                                      UnknownData19[0x50];                                      // 0x0C0C(0x0050) UNKNOWN PROPERTY: SetProperty ShadowTrackerExtra.STExtraPlayerController.TouchIndexSet
	float                                              DoubleClickFireTimeThreshold;                             // 0x0C70(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PC_CameraMoveRateY;                                       // 0x0C74(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FCommonCameraModeData                       NearCameraModeData;                                       // 0x0C78(0x0024) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData20[0x4];                                       // 0x0C9C(0x0004) MISSED OFFSET
	struct FTransform                                  FPPModeSpringArmTrans;                                    // 0x0CA0(0x0030) (IsPlainOldData)
	unsigned char                                      UnknownData21[0x80];                                      // 0x0CD0(0x0080) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerEnterFighting;                                    // 0x0D50(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bDebugShowYawInput : 1;                                   // 0x0D60(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData22[0x7];                                       // 0x0D61(0x0007) MISSED OFFSET
	TEnumAsByte<ETouchIndex>                           FreeCameraFigerIndex;                                     // 0x0D68(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData23[0x3];                                       // 0x0D69(0x0003) MISSED OFFSET
	struct FVector                                     ForceJumpLocation;                                        // 0x0D6C(0x000C) (IsPlainOldData)
	unsigned char                                      UnknownData24[0x4];                                       // 0x0D78(0x0004) MISSED OFFSET
	float                                              MoveableLandHardTime;                                     // 0x0D7C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FreeCamera_FPP_PITCH_MAX;                                 // 0x0D80(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CanSprintCDTime;                                          // 0x0D84(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnTeammateHPChangeDelegate;                               // 0x0D88(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UCurveFloat*                                 CurveFPPCameraLerp;                                       // 0x0D98(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      CharacterTouchMove : 1;                                   // 0x0DA0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData25 : 8;                                        // 0x0DA1(0x0001)
	unsigned char                                      IsDeadForLogout : 1;                                      // 0x0DA1(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData26[0x2];                                       // 0x0DA2(0x0002) MISSED OFFSET
	float                                              Mobile_CameraMoveRateX;                                   // 0x0DA4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnPlayerCanCutOffParachute;                               // 0x0DA8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FVector2D                                   StartPosition;                                            // 0x0DB8(0x0008) (IsPlainOldData)
	struct FScriptMulticastDelegate                    OnUnequipWeaponDel;                                       // 0x0DC0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnPlayerCannotCutOffParachute;                            // 0x0DD0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData27[0x48];                                      // 0x0DE0(0x0048) MISSED OFFSET
	class ASTExtraBaseCharacter*                       closedAimTarget;                                          // 0x0E28(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FPlayerBaseInfoInOB>                 TotalPlayers;                                             // 0x0E30(0x0010) (Net, ZeroConstructor)
	unsigned char                                      DiedisableInput : 1;                                      // 0x0E40(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData28[0x7];                                       // 0x0E41(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    RunOnNextFrameDelegate;                                   // 0x0E48(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UNewbieGuideComponent*                       NewbieComponent;                                          // 0x0E58(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	TEnumAsByte<ETouchFireType>                        TouchFireType;                                            // 0x0E60(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData29[0x7];                                       // 0x0E61(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCharacterBreathChange;                                  // 0x0E68(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnSpectatorChange;                                        // 0x0E78(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              FreeCamera_FPP_MAX;                                       // 0x0E88(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FreeCameraSPL_Ver;                                        // 0x0E8C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FreeCamera_FPP_PITCH_MIN_LIMITED;                         // 0x0E90(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData30[0x4];                                       // 0x0E94(0x0004) MISSED OFFSET
	struct FWeaponSystemReconnectReplicateData         WeaponSystemReconnectReplicateData;                       // 0x0E98(0x0030) (Net)
	int                                                GameTipMsgID;                                             // 0x0EC8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData31[0x4];                                       // 0x0ECC(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStopFireEvent;                                          // 0x0ED0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData32[0x8];                                       // 0x0EE0(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnUseMainSlot;                                            // 0x0EE8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnBackpackMainSlot;                                       // 0x0EF8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UGuideComponent*                             GuideComponent;                                           // 0x0F08(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              AccumulateYawInput;                                       // 0x0F10(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData33[0x4];                                       // 0x0F14(0x0004) MISSED OFFSET
	struct FName                                       AutoScopeAimCompName;                                     // 0x0F18(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FCommonCameraModeData                       NormalCameraModeData;                                     // 0x0F20(0x0024) (Edit, BlueprintVisible, BlueprintReadOnly)
	TEnumAsByte<ETouchIndex>                           OnFireTouchFingerIndex;                                   // 0x0F44(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData34[0x3];                                       // 0x0F45(0x0003) MISSED OFFSET
	float                                              JoystickTriggerSprintDuration;                            // 0x0F48(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData35[0xC];                                       // 0x0F4C(0x000C) MISSED OFFSET
	unsigned char                                      bCanGetTouchInput : 1;                                    // 0x0F58(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData36[0x57];                                      // 0x0F59(0x0057) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerExitFighting;                                     // 0x0FB0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData37[0x1];                                       // 0x0FC0(0x0001) MISSED OFFSET
	unsigned char                                      bIsBattleOwner : 1;                                       // 0x0FC1(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData38[0x6];                                       // 0x0FC2(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnUseInventoryItem;                                       // 0x0FC8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData39[0x10];                                      // 0x0FD8(0x0010) MISSED OFFSET
	float                                              FPPInteractableAngle;                                     // 0x0FE8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData40[0xC];                                       // 0x0FEC(0x000C) MISSED OFFSET
	struct FCommonCameraModeData                       PlaneCameraModeData;                                      // 0x0FF8(0x0024) (Edit, BlueprintVisible, BlueprintReadOnly)
	float                                              LandAfterJumpPlaneDelayMoveTime;                          // 0x101C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FreeCamera_FPP_MIN;                                       // 0x1020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData41[0x4];                                       // 0x1024(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnRemoveMainSlot;                                         // 0x1028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FName                                       PlayerControllerState;                                    // 0x1038(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnPlayerNameChange;                                       // 0x1040(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bIsTouching : 1;                                          // 0x1050(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData42[0x3];                                       // 0x1051(0x0003) MISSED OFFSET
	struct FVector2D                                   NearCameraModeCameraMoveAdditionalRate;                   // 0x1054(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData43[0x44];                                      // 0x105C(0x0044) MISSED OFFSET
	struct FScriptMulticastDelegate                    triggerMoveVoiceCheckDelegate;                            // 0x10A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData44[0x50];                                      // 0x10B0(0x0050) MISSED OFFSET
	float                                              AutoSprintRequestCD;                                      // 0x1100(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      bMoveableLandHard : 1;                                    // 0x1104(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData45[0x3];                                       // 0x1105(0x0003) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerPickUpActor;                                      // 0x1108(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	int                                                MaxCacheInputSpeedNum;                                    // 0x1118(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData46[0x4];                                       // 0x111C(0x0004) MISSED OFFSET
	struct FObservedData                               ObservedData;                                             // 0x1120(0x0028) (BlueprintVisible)
	int                                                UseMotionControlType;                                     // 0x1148(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData47[0x4];                                       // 0x114C(0x0004) MISSED OFFSET
	struct FString                                     GameTipParam1;                                            // 0x1150(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	float                                              MinFovChangeView;                                         // 0x1160(0x0004) (Edit, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData48[0x4];                                       // 0x1164(0x0004) MISSED OFFSET
	class UChatComponent*                              ChatComponent;                                            // 0x1168(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      bTrackingKillerEnabled : 1;                               // 0x1170(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData49[0x17];                                      // 0x1171(0x0017) MISSED OFFSET
	float                                              CanOpenParachuteHeight;                                   // 0x1188(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData50[0x4];                                       // 0x118C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerCanOpenParachute;                                 // 0x1190(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bUseDisCurve : 1;                                         // 0x11A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData51[0x4F];                                      // 0x11A1(0x004F) MISSED OFFSET
	class UPlayerControllerState*                      PlayerControllerStateFighting;                            // 0x11F0(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData52[0x8];                                       // 0x11F8(0x0008) MISSED OFFSET
	class AActor*                                      PlaneActor;                                               // 0x1200(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bCanOpenParachute : 1;                                    // 0x1208(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData53 : 8;                                        // 0x1209(0x0001)
	unsigned char                                      bIsAutoAimOnlyOnFire : 1;                                 // 0x1209(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData54[0x2];                                       // 0x120A(0x0002) MISSED OFFSET
	float                                              InHouseSpringArmLengthModifierChangeSpeed;                // 0x120C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FreeCameraStartMinPitchMax;                               // 0x1210(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData55[0x4];                                       // 0x1214(0x0004) MISSED OFFSET
	struct FKillOrPutDownMessage                       KillOrPutDownMessageData;                                 // 0x1218(0x00C8) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      bIsUseDisOrSpeedMove : 1;                                 // 0x12E0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData56[0x3];                                       // 0x12E1(0x0003) MISSED OFFSET
	float                                              MoveCameraMinTimeThreshold;                               // 0x12E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAimCameraModeData                          AimCameraModeData;                                        // 0x12E8(0x0024) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData57[0x4];                                       // 0x130C(0x0004) MISSED OFFSET
	class UPlayerControllerStateMachine*               PlayerControllerStateMachine;                             // 0x1310(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<class AActor*>                              nowGrenadeList;                                           // 0x1318(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UPlayerControllerState*                      PlayerControllerStateFlying;                              // 0x1328(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnPlayerEnterJumping;                                     // 0x1330(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData58[0x8];                                       // 0x1340(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnGameStartCountDownDelegate;                             // 0x1348(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bNeedSetFireTouchFingerIndex : 1;                         // 0x1358(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData59[0x7];                                       // 0x1359(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerEnterFinished;                                    // 0x1360(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnRepPlayerState;                                         // 0x1370(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	int                                                WeaponReconnectOpIndex;                                   // 0x1380(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData60[0x14];                                      // 0x1384(0x0014) MISSED OFFSET
	TArray<class ASTExtraVehicleBase*>                 nowNearVehicleList;                                       // 0x1398(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnMatchSessionChange;                                     // 0x13A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              RescueRemainingSeconds;                                   // 0x13B8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData61[0x4];                                       // 0x13BC(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStartFireEvent;                                         // 0x13C0(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    OnAutoSprintActive;                                       // 0x13D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData62[0x4D];                                      // 0x13E0(0x004D) MISSED OFFSET
	unsigned char                                      MaxTouchMoveDelayFrame;                                   // 0x142D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData63[0x2];                                       // 0x142E(0x0002) MISSED OFFSET
	TArray<struct FBattleItemData>                     ObservedItemList;                                         // 0x1430(0x0010) (Net, ZeroConstructor)
	EObserverAuthorityType                             ObserverAuthorityType;                                    // 0x1440(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData64[0x17];                                      // 0x1441(0x0017) MISSED OFFSET
	struct FScriptMulticastDelegate                    triggerVehicleVoiceCheckDelegate;                         // 0x1458(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FClientFatalDamageRecordData>        ClientFatalDamageRecords;                                 // 0x1468(0x0010) (BlueprintVisible, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnLostConnection;                                         // 0x1478(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FVector2D                                   AimCameraModeCameraMoveMaxSpeed;                          // 0x1488(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnPossessingCharacterDeathDelegate;                       // 0x1490(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTakeDamagedDelegate;                                    // 0x14A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TMap<TEnumAsByte<ETouchIndex>, float>              TouchForceMap;                                            // 0x14B0(0x0050) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	float                                              OceanSideDetectInterval;                                  // 0x1500(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData65[0x4];                                       // 0x1504(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPingChangeDelegate;                                     // 0x1508(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FServerHitEnemyReplicatedData               ServerHitEnemyReplicatedData;                             // 0x1518(0x0010) (BlueprintVisible, BlueprintReadOnly, Net)
	unsigned char                                      UnknownData66[0x38];                                      // 0x1528(0x0038) MISSED OFFSET
	TArray<struct FPlayerInfoInOB>                     SameTeamPlayerList;                                       // 0x1560(0x0010) (BlueprintVisible, ZeroConstructor)
	struct FScriptMulticastDelegate                    triggerGlassVoiceCheckDelegate;                           // 0x1570(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<class ASTExtraShootWeapon*>                 nowShotWeaponList;                                        // 0x1580(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData67[0x8];                                       // 0x1590(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStartAutoSprintCountDown;                               // 0x1598(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData68[0x18];                                      // 0x15A8(0x0018) MISSED OFFSET
	struct FScriptMulticastDelegate                    On3DTouchForceChange;                                     // 0x15C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UBackpackComponent*                          BackpackComponent;                                        // 0x15D0(0x0008) (ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<struct FTeamMateStateInfo>                  TeamMateStates;                                           // 0x15D8(0x0010) (ZeroConstructor)
	TMap<TEnumAsByte<ETouchIndex>, struct FTeamMateStateInfo> DoubleClickLastTouchInfoMap;                              // 0x15E8(0x0050) (ZeroConstructor)
	TMap<TEnumAsByte<ETouchIndex>, struct FTeamMateStateInfo> DoubleClickCurTouchInfoMap;                               // 0x1638(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData69[0x8];                                       // 0x1688(0x0008) MISSED OFFSET
	class AActor*                                      ThePlane;                                                 // 0x1690(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	float                                              JoystickSprintDisThreshold;                               // 0x1698(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                FireMode;                                                 // 0x169C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData70[0x74];                                      // 0x16A0(0x0074) MISSED OFFSET
	unsigned char                                      bCanCloseParachute : 1;                                   // 0x1714(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData71[0x3];                                       // 0x1715(0x0003) MISSED OFFSET
	TArray<struct FPlayerInfoInOB>                     NearPlayerList;                                           // 0x1718(0x0010) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData72[0x4];                                       // 0x1728(0x0004) MISSED OFFSET
	float                                              CloseParachuteHeight;                                     // 0x172C(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	TArray<class ASTExtraBaseCharacter*>               nowNearCharacterList;                                     // 0x1730(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData73[0x10];                                      // 0x1740(0x0010) MISSED OFFSET
	class APlayerTombBox*                              DeadTombBox;                                              // 0x1750(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData74[0x14];                                      // 0x1758(0x0014) MISSED OFFSET
	int                                                DefaultParachuteItemID;                                   // 0x176C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FSensibilityConfig                          SensibilityConfig;                                        // 0x1770(0x0054) (BlueprintVisible)
	unsigned char                                      UnknownData75[0x4];                                       // 0x17C4(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerCannotOpenParachute;                              // 0x17C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData76[0x10];                                      // 0x17D8(0x0010) MISSED OFFSET
	unsigned char                                      bMoveInMiniMap : 1;                                       // 0x17E8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData77 : 8;                                        // 0x17E9(0x0001)
	unsigned char                                      bIsLandingOnGround : 1;                                   // 0x17E9(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData78 : 8;                                        // 0x17EA(0x0001)
	unsigned char                                      bAlreadyFired : 1;                                        // 0x17EA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData79[0x5];                                       // 0x17EB(0x0005) MISSED OFFSET
	struct FString                                     MurderName;                                               // 0x17F0(0x0010) (ZeroConstructor)
	float                                              FreeCameraStartMinPitchMin;                               // 0x1800(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                TouchForceWatchFrame;                                     // 0x1804(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData80[0x8];                                       // 0x1808(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnExitGame;                                               // 0x1810(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	class AActor*                                      OwnerPlane;                                               // 0x1820(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnSwitchCameraModeEnd;                                    // 0x1828(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData81[0x8];                                       // 0x1838(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnLocalCharacterHPChangeDel;                              // 0x1840(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              RealTimePawnHeight;                                       // 0x1850(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData82[0xC];                                       // 0x1854(0x000C) MISSED OFFSET
	unsigned char                                      EnableAsyncLoading : 1;                                   // 0x1860(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData83[0x7F];                                      // 0x1861(0x007F) MISSED OFFSET
	TArray<TEnumAsByte<ETouchIndex>>                   IgnoreCameraMovingIndexArray;                             // 0x18E0(0x0010) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData84[0x38];                                      // 0x18F0(0x0038) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnRank;                                                   // 0x1928(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      IsCurrentSpectatorFreeView : 1;                           // 0x1938(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData85[0x57];                                      // 0x1939(0x0057) MISSED OFFSET
	float                                              AutoScopeAimTraceDistance;                                // 0x1990(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData86[0x4];                                       // 0x1994(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerExitJumping;                                      // 0x1998(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData87[0x9];                                       // 0x19A8(0x0009) MISSED OFFSET
	TEnumAsByte<ETouchIndex>                           OnFreeCameraFingerIndex;                                  // 0x19B1(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData88[0x6];                                       // 0x19B2(0x0006) MISSED OFFSET
	float                                              PC_CameraMoveRateX;                                       // 0x19B8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TestForce;                                                // 0x19BC(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USpringArmComponent*                         CurrentActiveSpringArmCache;                              // 0x19C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnDoubleClickCheck;                                       // 0x19C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData89[0x78];                                      // 0x19D8(0x0078) MISSED OFFSET
	unsigned char                                      bEnableAutoAimTrainingMode : 1;                           // 0x1A50(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData90 : 8;                                        // 0x1A51(0x0001)
	unsigned char                                      bIsRightScreenUseComfortableSwipe : 1;                    // 0x1A51(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData91[0xE];                                       // 0x1A52(0x000E) MISSED OFFSET
	class ATslPostProcessEffect*                       OutlineEffectClass;                                       // 0x1A60(0x0008) (ZeroConstructor, Config, IsPlainOldData)
	float                                              OutlineEffectMultiplyValue;                               // 0x1A68(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData92[0x4];                                       // 0x1A6C(0x0004) MISSED OFFSET
	class ATslPostProcessEffect*                       OutlineEffect;                                            // 0x1A70(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class ATslTracerManager*                           TracerManager;                                            // 0x1A78(0x0008) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData93[0x4];                                       // 0x1A80(0x0004) MISSED OFFSET
	unsigned char                                      bPlayWinnerWinnerChickenDinnerAnimationAtMatchFinished : 1;// 0x1A84(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData94[0xB];                                       // 0x1A85(0x000B) MISSED OFFSET
	TArray<struct FPlayerInfoInOB>                     TotalPlayerList;                                          // 0x1A90(0x0010) (BlueprintVisible, ZeroConstructor)
	float                                              RecoverLagDelayTime;                                      // 0x1AA0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bIsLeftScreenUseComfortableSwipe : 1;                     // 0x1AA4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData95[0x3];                                       // 0x1AA5(0x0003) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnGameStartDelegate;                                      // 0x1AA8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInterruptAutoSprintCountDown;                           // 0x1AB8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              MovealbeSwitchPoseTime;                                   // 0x1AC8(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ComfortableSwipeAddition;                                 // 0x1ACC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FLinearColor                                CrossHairColor;                                           // 0x1AD0(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData96[0x4];                                       // 0x1AE0(0x0004) MISSED OFFSET
	float                                              MoveCameraMinDistanceThreshold;                           // 0x1AE4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData97[0x8];                                       // 0x1AE8(0x0008) MISSED OFFSET
	TArray<struct FAirDropBoxInOb>                     AirDropBoxList;                                           // 0x1AF0(0x0010) (BlueprintVisible, Net, ZeroConstructor)
	unsigned char                                      UnknownData98[0x28];                                      // 0x1B00(0x0028) MISSED OFFSET
	TArray<class ATslLPCPlayerState*>                  KillerTeamPlayerStates;                                   // 0x1B28(0x0010) (Net, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnPlayerCanJump;                                          // 0x1B38(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UMeshComponent*                              SpectatorScopingMesh;                                     // 0x1B48(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnEquipWeaponDel;                                         // 0x1B50(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              InteractableAngle;                                        // 0x1B60(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData99[0x4];                                       // 0x1B64(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnReconnected;                                            // 0x1B68(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FVector2D                                   AimCameraModeCameraMoveAdditionalRate;                    // 0x1B78(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData100[0x8];                                      // 0x1B80(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnAboutToChangeViewTarget;                                // 0x1B88(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFinishedChangeViewTarget;                               // 0x1B98(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      MurderIsAI : 1;                                           // 0x1BA8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData101 : 8;                                       // 0x1BA9(0x0001)
	unsigned char                                      bIsLastTwoCircle : 1;                                     // 0x1BA9(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData102[0x2];                                      // 0x1BAA(0x0002) MISSED OFFSET
	struct FRotator                                    FreeCameraStartRotation;                                  // 0x1BAC(0x000C) (IsPlainOldData)
	class ASTExtraBaseCharacter*                       STExtraBaseCharacter;                                     // 0x1BB8(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData103[0x4];                                      // 0x1BC0(0x0004) MISSED OFFSET
	float                                              OceanSideDetectDistance;                                  // 0x1BC4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              JoystickSprintAngleThreshold;                             // 0x1BC8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              JoystickSprintDisThresholdNew;                            // 0x1BCC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    triggerVoiceCheckDelegate;                                // 0x1BD0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCharacterRecoveryHealth;                                // 0x1BE0(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData104[0x4];                                      // 0x1BF0(0x0004) MISSED OFFSET
	struct FVector2D                                   NearCameraModeCameraMoveMaxSpeed;                         // 0x1BF4(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData105[0x4];                                      // 0x1BFC(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerEnterFlying;                                      // 0x1C00(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData106[0x10];                                     // 0x1C10(0x0010) MISSED OFFSET
	class UPlayerControllerState*                      PlayerControllerStateActive;                              // 0x1C20(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnPlayerPutDownActor;                                     // 0x1C28(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              InHouseSpringArmLengthModifier;                           // 0x1C38(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      EnableNetCullingDistOnVeryLowDevice : 1;                  // 0x1C3C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData107[0x43];                                     // 0x1C3D(0x0043) MISSED OFFSET
	struct FVector                                     CurScreenMoveSpeed;                                       // 0x1C80(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData108[0x8];                                      // 0x1C8C(0x0008) MISSED OFFSET
	unsigned char                                      bIsAutoAimEnabled : 1;                                    // 0x1C94(0x0001) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData109[0x3];                                      // 0x1C95(0x0003) MISSED OFFSET
	float                                              FreeCamera_FPP_PITCH_MIN;                                 // 0x1C98(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData110[0x4];                                      // 0x1C9C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnDamageToOther;                                          // 0x1CA0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TMap<TEnumAsByte<ESTEPoseState>, struct FCameraViewPitchLimitData> CameraViewPitchLimitDataMap;                              // 0x1CB0(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FScriptMulticastDelegate                    OnPlayerExitParachute;                                    // 0x1D00(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              ForceOpenParachuteHeight;                                 // 0x1D10(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EnmSprintOptType>                      sprintOptType;                                            // 0x1D14(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData111[0x3];                                      // 0x1D15(0x0003) MISSED OFFSET
