#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShowOp.BP_STRUCT_ShowOp
// 0x0006
struct FBP_STRUCT_ShowOp
{
	bool                                               isCommander_0_A28A51D74E11E51E638FAD9622F2703E;           // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isFriend_1_37DF76F14EC1DBE7F8D7E3BCF0B9317A;              // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isMe_5_6A99B7044079AD66A8EA84923D6FB296;                  // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               isSecCommander_9_33D018807EA486804913243604C5B502;        // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               otherSecCommander_10_407D0A007334F90A2574C8310DD518E2;    // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               otherCommander_11_023223401ACF83B93361AE0902B4A522;       // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
