#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CombatBattleInfo.BP_STRUCT_CombatBattleInfo
// 0x0050
struct FBP_STRUCT_CombatBattleInfo
{
	struct FString                                     role_maxkill_2_58CE666D4673E6D7265F1A864AD05E3E;          // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_maxdamage_3_60A3553A4B1764EAF61B3BAE9DB24FE1;        // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_avedamage_4_E85C6DBA482F06B1BECE69BF6F5778C8;        // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_critcount_7_88CD072C4630F97CA8E23DB857109F80;        // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_hitrate_8_03BBCD074A87A51BF24FE9A79728243F;          // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
