#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CombatTotalInfo.BP_STRUCT_CombatTotalInfo
// 0x0060
struct FBP_STRUCT_CombatTotalInfo
{
	struct FString                                     role_killnum_0_A1A2198E44D3CAE87C081DA315797738;          // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_toptennum_2_9FCD52494212746B5A04A78D218E94A9;        // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_allmatchnum_3_ED5E0DF746C452FC5A48128C2E0175B6;      // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_winnum_4_D7292DF944699A11874005B69404DFFD;           // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_kd_5_7A487E494B801B55EE0FE1A8AEF1910D;               // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_critrate_6_0BB7652A4793E86F3B8FEEB1D817FE56;         // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
