#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_HomePageCorpsInfo.BP_STRUCT_HomePageCorpsInfo
// 0x0020
struct FBP_STRUCT_HomePageCorpsInfo
{
	int                                                icon_0_8145C08B41C8FFCF51457C9281A0E618;                  // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                city_10_1C76D3604B10D815C235A8A1CDA114C9;                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_8_9629D5B843C5E7A84CD5B186CF5BA3E1;                  // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_9_AE4D89B4410A7376C66C9B8166E2C62F;                 // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                exp_12_BA45D404422E14AF0DE6D8A253D977E9;                  // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
