#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Promotion_Award_Info.BP_STRUCT_Promotion_Award_Info
// 0x0020
struct FBP_STRUCT_Promotion_Award_Info
{
	int                                                currentInviteCount_0_11AFDC824E74A36DFA0E8D9BE9284ED7;    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                itemIdx_1_39E464294AE9AB488F24D596B71BFFDE;               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                status_2_F3C06E6E4CC00545DCB8C19A95BE89F3;                // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                actID_3_D68715044A1716E8CAD23D8EA340B48E;                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                awardID_4_E168DE3B43358B3DF2987BA145A336F0;               // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                needInviteCount_5_93313FC147EE030C137224B6AA6C9588;       // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                mainActID_6_5F9B5DC446E07EA11BE38D809934CF48;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                expireTime_7_D3D7F0E04F42F4ED95DE608E3740DCC9;            // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
