#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsShopClothingInfo.BP_STRUCT_CorpsShopClothingInfo
// 0x0018
struct FBP_STRUCT_CorpsShopClothingInfo
{
	int                                                item_id_0_317757F2496E33999D69DCB008C93BD3;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                unlock_corps_level_1_2D18B5054EB756B11F1DA790C0EDD2C5;    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sort_id_2_C997EB5C40BBF1F702C83ABAA9FF828D;               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                consume_corps_money_3_1BD61F36478338291EE3D79663FD2862;   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                has_buy_num_4_47B45D000E12532A62F8DBA207FF72CD;           // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                limit_buy_num_5_320275C009BFF8F1165AEBB405918DAD;         // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
