#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_MusterBindPlayer.BP_STRUCT_MusterBindPlayer
// 0x0068
struct FBP_STRUCT_MusterBindPlayer
{
	int                                                gender_0_36AED5001C7F046676AF1AFA0357A672;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     url_1_7FAA6C803DF248782FB222050ECB245C;                   // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                qq_vip_2_68423BC0343B15BB7ED0222C020C81B0;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_3_06355DC0011857E766A65A1A0B4A127C;                 // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     platName_4_0B01444037503D570272EF190F65F6C5;              // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                startup_type_5_509844C0240109654807A99A0E81E565;          // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_6_0E78B6C05C26CD7B18D81E15068C7704;     // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_solo_7_200F7B807EFD2070263DBEE80790EB3F;          // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_duo_8_6FF13E4049359C9D74AA8B5C01793F4F;           // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_squad_9_648193C034F3021377206F30090E7A04;         // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
	struct FString                                     uid_10_587688401B16E0A92FB221240ECB2324;                  // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_11_1B59000013E649462DDAD1880CB4CBD5;                 // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
