#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_ShortHand.BP_STRUCT_ShortHand
// 0x003C
struct FBP_STRUCT_ShortHand
{
	struct FString                                     ShortHandUrl_0_246A6F806C239508375333080C997F0C;          // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ShortHandType_1_3113EB40783CBC534F6F577D099798A5;         // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                IsSelect_2_5E98870015FF3CB05E14D2430A122FC4;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     ShortHandDesc_3_206782804D9053704085AF7D09969453;         // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShortHandName_4_5A4783004C61BAD64F1244AE099780F5;         // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ShortHandID_5_4F980600376AF78A13FD704B08C996E4;           // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
