#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_GuideText_type.BP_STRUCT_GuideText_type
// 0x0048
struct FBP_STRUCT_GuideText_type
{
	int                                                GuideID_0_A5FF72E542F02CBBCE5E2696B9B5AE1E;               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                TriggerTimes_1_092A596A4CD84CDBCEAB7CAC1E5C6784;          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     text4_2_0681BED6478BF4BE2672C1B126FF6E1E;                 // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     text1_3_0B618F7F449909BFB58A3E98E3DB73DE;                 // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     text2_4_F5471C1F44A2ADB1B71AD3A2991F2C29;                 // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     text3_5_5E534A744DCD782353B99F94D72CF42E;                 // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
