#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_NoticeInfo.BP_STRUCT_NoticeInfo
// 0x00A0
struct FBP_STRUCT_NoticeInfo
{
	struct FString                                     jump_mode2_0_0AFCDDDE4E49D68EC1E458B7C6E1756D;            // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_1_65F7370B4527B75928D74181AAB77CBB;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FString                                     content_2_7324FFD24CC05DCD4260EA8C6D1905D4;               // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     button_desc_3_66D8B787439345A3F9AACF868C189546;           // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                mark_type_4_631B1E224D9CDBF607B59BB6BB662C72;             // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	struct FString                                     mark_desc_5_30A41C5243CA99A80FC828B1A79A9D96;             // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jump_button2_6_EFE006FA4E76444AA82F5C9E69C799BE;          // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jump_button1_7_C487EA014040DEE90177F6BBE53EDD1B;          // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     pic_url_8_730A7D1C4C637BA216734BA435E34DD3;               // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     jump_mode1_9_C90DD91148C86A368099CDB014DD5C35;            // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     title_10_479143544DB76C39CF8D18B3AF266A85;                // 0x0090(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
