#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_BTRating.BP_STRUCT_BTRating
// 0x0018
struct FBP_STRUCT_BTRating
{
	int                                                change_rank_rating_30_3022F3C649CCAF70ED2262AEFF63941A;   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                change_win_rating_31_8E3F5C4C45B48822803F06B5830EAEF0;    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                kill_rating_32_887C5E6C43E2754281639FB8224EE63A;          // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                change_kill_rating_33_292F57254C9D5A389F6501A63B1743BF;   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                rank_rating_34_FCA5AD94413785C36C9A0EAF24EA56FB;          // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                win_rating_35_D18CD8AB4F2C342EDA0EE2BC6FB10C24;           // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
