#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CombatGradeInfo.BP_STRUCT_CombatGradeInfo
// 0x0070
struct FBP_STRUCT_CombatGradeInfo
{
	struct FString                                     survive_score_0_B3A6B084422611AF0080C788460C5D5F;         // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     grade_1_85F15110437EDA1B30859F9C8B4E7F96;                 // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     top1_score_2_FC910E284FB4636E3ECE04B7AB6DE9DE;            // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     sum_score_3_AF0C580D4C8655974D975EA6C592EC04;             // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     rating_score_4_FDE2A5FE4179E5391AC941B476155C0D;          // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     fight_score_5_B4F5AD204EF27F0F4C438FB099F5357E;           // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     assist_score_6_EDABE3F14E55DF4A4182D2BD9AB3626A;          // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
