#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TopTipProfileInfo.BP_STRUCT_TopTipProfileInfo
// 0x0074
struct FBP_STRUCT_TopTipProfileInfo
{
	struct FString                                     picUrl_0_10CF6840485ADF993EE111440CCD2A9C;                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     remarks_name_1_3D0289C05A72E4A9719DD35C0EC0DA95;          // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     platName_2_5CB07900482FC40C328C7539002F5CE5;              // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     gid_3_7BA319807BE7E4DE0948207D0A61D7D4;                   // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ladder_4_7BF06780435D245A4DB310310E850CD2;                // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                history_max_segment_level_5_00B92C80592B8076252F5A230D7DADCC;// 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     nickName_6_2233B6001C18577A17766F060D3A5AD5;              // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                vipLevel_7_3C783E4069B5A20733AB7B1A02F4D0CC;              // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_8_4EA68B8050EC0CF0777D456A0CAEA3A4;     // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_info_solo_9_69B79300264875321E816A6E08ED6E3F;     // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_info_squad_10_6C95EB4059F5D9D1494FE6AC0ED60AF4;   // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_11_186FB2801FB49B423A1145B701E8E6DC;                // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                segment_info_duo_12_790D15C04CBC6F1F21D0851E018EE73F;     // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sex_13_78CCA0801E2C8F220948F1200A61C3E8;                  // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
