#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FPPCombatTotalInfo.BP_STRUCT_FPPCombatTotalInfo
// 0x0060
struct FBP_STRUCT_FPPCombatTotalInfo
{
	struct FString                                     role_toptennum_0_40010F007A84FD886E0958450EF641AD;        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_allmatchnum_1_0A7E3A0045EF75286C8D283906E699DD;      // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_critrate_2_479D6C000119B05A535F3E55009E6CE5;         // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_killnum_3_12B453805F0DAD9E7A62CE5F089C8BED;          // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_kd_4_3C0B2840767EACFD5F1979630795E584;               // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_winnum_5_0128BC0016CB752E36080D900749E05D;           // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
