#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsInfoRankInfo.BP_STRUCT_CorpsInfoRankInfo
// 0x0030
struct FBP_STRUCT_CorpsInfoRankInfo
{
	struct FString                                     season_rank_6_2CC56D007CCAC33062526AF80A6559CB;           // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     week_rank_7_078135C07D2315A96DB00A8A0DFAE19B;             // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                season_award_num_2_796ED1806EEED41839BF442C0030409D;      // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                week_award_num_3_43D0BA4074C2370F191DF6B50557DB1D;        // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_award_id_4_515F70C038E5F0A73FB11194020303A4;       // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                week_award_id_5_65D9B98039918540715F6BDB0A557C14;         // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
