#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RankInfo.BP_STRUCT_RankInfo
// 0x0098
struct FBP_STRUCT_RankInfo
{
	struct FString                                     uid_0_951191854B1D7BD586C9E9B45AAFBB4A;                   // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                no_1_4182BB0342C89B0CBA9E76BCB162879E;                    // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FString                                     city_2_DC3408564E16BC35A7D486A3BA901971;                  // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     name_3_209DAE1B40FE2734E586148DBA1E05CE;                  // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     content2_4_66789CC04460A8E81B602D9B88B5B0CA;              // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                score_5_FE06130944A19326737A559A99B839E9;                 // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
	struct FString                                     content1_6_31E885C04FA17436582AFA8F43A0FF1B;              // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     content3_7_A9E0BD10434A6F597EF6C59F5C8F50E0;              // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_8_171CD1454F7F502EE78307B2451E6131;                // 0x0070(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_9_D030C1A14ED97F063BFC45ABD7E298E1;                 // 0x0074(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     url_10_5EA6E3534B86E9977C811B961923CAB4;                  // 0x0078(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                segment_12_746755464BE574F47F70AABAADC82602;              // 0x0088(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                qq_vip_13_0AA66F654565D1764BAD9AA9279D2240;               // 0x008C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                startup_type_14_D2DB30A049EBDECCC4E0049FC408C8EA;         // 0x0090(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                cur_avatar_box_id_15_84D640C64D178EE1D04261885C48CB1C;    // 0x0094(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
