#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_FPPCombatBattleInfo.BP_STRUCT_FPPCombatBattleInfo
// 0x0050
struct FBP_STRUCT_FPPCombatBattleInfo
{
	struct FString                                     role_avedamage_0_60E27140103FA57D5776B48E0D9D4445;        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_critcount_1_00D361401B5C944F56DB5F7606931BB4;        // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_hitrate_2_62ACA6C06A10E341123F2261065DB3D5;          // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_maxdamage_3_462093C038DFAF7154B58098089DBF05;        // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_maxkill_4_19F28700299C329854334FFC08D925AC;          // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
