#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_EXP_DETAIL.BP_STRUCT_EXP_DETAIL
// 0x0034
struct FBP_STRUCT_EXP_DETAIL
{
	int                                                top10_exp_3_013756914AA1FE54CB7658B358D0D676;             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                survive_exp_5_1F97DA454BCAE391513351AFD28DCD7B;           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                first_exp_6_AFB516494C709E676E25E48CE5A0AA20;             // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                plat_add_7_EA668F014E3B053398611E8D931A5A99;              // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                exp_card_add_8_30D29AC54D7C8082F1559C92352B8359;          // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                kill_exp_9_BB37F4124C97EF02A60499A52D400562;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                team_add_10_10F66846423F93E5D7BAB38E1FD776AE;             // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                qq_super_vip_add_11_B3432DB648D5C25A3C1B72993FA6829C;     // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                watch_exp_12_CA24C04C40AF2BA6AB59E18CEB7DEAC5;            // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                clan_add_16_6E6968EE4071A5D28B89F5B107B3842A;             // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sm_add_17_CBB55CB742D04E0BDA34C6951113243E;               // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                famous_master_add_18_2E6EE5F94DCE915324349C873715F986;    // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                limitact_double_exp_rate_19_68CD970052734F686CF2E8C10289F475;// 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
