#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_CorpsSummary.BP_STRUCT_CorpsSummary
// 0x0088
struct FBP_STRUCT_CorpsSummary
{
	struct FString                                     str_city_10_44E9B6C05C8DA3656E8FFEBB0F7A6C69;             // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                n_member_num_11_125FF78010E946442858568A0696804D;         // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FString                                     str_announcement_12_4C71AB4033084EDF69274FEE0E539384;     // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                n_member_max_13_0BF0B5000D119E4428583EBE06968678;         // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                n_level_14_09E333C025BB705F2F22069B0523305C;              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                n_join_level_15_6AAC5780577FDCA075BD1C260E10E6FC;         // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
	struct FString                                     str_corps_id_16_6CEFDD402C56D31F66A4B3840A490F94;         // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     str_name_18_608870C05867B88F6EBE67000F7B8CE5;             // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                n_position_19_7B58AB000D406C784A655F6C096EFEDE;           // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                n_icon_20_4E26F80058A27DFC14B2A52D0E51E79E;               // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                n_leader_21_2F4369003663151840D6B9C40234B492;             // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                n_activeness_22_230EDB00425249427A5834450E9B29D3;         // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               b_IsOwnApply_23_40318840076C00536F5D471101307099;         // 0x0068(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0069(0x0003) MISSED OFFSET
	int                                                n_join_segment_26_078B4E40059DAFFB2B49E7DB0B987664;       // 0x006C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               b_IsInvited_27_1066EE807C2FD2E82737A776048E8B34;          // 0x0070(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x0071(0x0007) MISSED OFFSET
	struct FString                                     str_icon_path_28_562EF5C007C5B03D360B478509D1CBC8;        // 0x0078(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
