#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_SelfMemberInfo.BP_STRUCT_SelfMemberInfo
// 0x006C
struct FBP_STRUCT_SelfMemberInfo
{
	int                                                day_active_0_2D363F0026644DF8583587E5055C4B85;            // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                position_2_6B32D60074AD493478BF022C0550893E;              // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                week_active_3_14AA5A801FB5B5104E46B237070437D5;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                svr_4_19EBEF802539ED1077A886D00D0279E2;                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FBP_STRUCT_BASE_INFO                        BP_STRUCT_BASE_INFO_5_0DDF4F802415ACB41D1EAB010A627FFF;   // 0x0010(0x0050) (Edit, BlueprintVisible)
	int                                                id_6_2DB08C0050CFBD166B0F18A703D026C4;                    // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                online_state_7_5A6F3A003E3FD12A1BB1D8970E13A8C5;          // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                season_active_8_0F2691C00AFFDF974C4BED4A0FFF1895;         // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
