#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RoleInfoHistoryRadarInfo.BP_STRUCT_RoleInfoHistoryRadarInfo
// 0x0050
struct FBP_STRUCT_RoleInfoHistoryRadarInfo
{
	struct FString                                     survive_score_0_E49F1CDC45113263DDE5A5840EE42220;         // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     support_score_1_76FFD9064D48F931BE1AF395D174F4BF;         // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     supply_score_2_0E9D477F450A041B5E8DA183D5F0F9AA;          // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     hurt_score_3_C3E8292B4E2E9AEC2DE06BA9611865FD;            // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     kill_score_4_0D9EF7684BBCA39F39BD19A360A28370;            // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
