#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeaponAttachments_type.BP_STRUCT_WeaponAttachments_type
// 0x0060
struct FBP_STRUCT_WeaponAttachments_type
{
	int                                                KeyID_12_DE29BA8D4D52E79C09ECD792B3E5AF59;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Magazine1ID_0_124FF7FA4E6B890EDD62C18B296C9E15;           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Magazine2ID_6_FBD967F34B076135939A34B346BAAB29;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Magazine3ID_4_A07A42D4425929C395081BAF5FDE2B06;           // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Stock1ID_5_F2636C554EE9EFF8BA685C92E9F3606C;              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Stock2ID_1_3FCB2F494E1FDFC2D41F59B93064182D;              // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Muzzle1ID_10_3B713F3C4A35C5FB29A4E0AF5C8A275F;            // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Muzzle2ID_7_9E03332A4752E38E637556B3FF0D5351;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Muzzle3ID_13_31FC5F55414852E7CF50EA9E5BD5B291;            // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Upper1ID_8_949763A341AFE79B4276AC83343C6558;              // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Upper2ID_9_3B7B6B314DBF635E73F159900A2B8FB1;              // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Upper3ID_14_C7B485EF4D1F55E148B29FB67ABD362A;             // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Upper4ID_11_37C554F5497AB2283775B9827CFB9CF0;             // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Upper5ID_15_ADA78DC74C7C4457E27098A829C60AB0;             // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Lower1ID_2_8C3FCF444675753570567D8F645FB103;              // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Lower2ID_3_32758B6241007F0497013AB8E1170794;              // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                BulletID_16_44E773704CA725FA3675CF8D5EE0F1A8;             // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ProposeBulletNum_17_776C3F00316F0B260271992A098E22ED;     // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Magazine4ID_25_C86DAD184D2E27B2EC728ABA1E6E610E;          // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Magazine5ID_27_A95DEE7E4D297553F446A286CEDD01DF;          // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Magazine6ID_45_F2B6E297413472720DFBEDAE16F48414;          // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Muzzle4ID_33_E00897014908E86DA74A28A605E5F970;            // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Muzzle5ID_35_920C33AC49A9AA1633982C991B943DA2;            // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Muzzle6ID_47_46DA982D4430CA695D04FAA9E742C287;            // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
