#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Reflux_Friend_Info.BP_STRUCT_Reflux_Friend_Info
// 0x0054
struct FBP_STRUCT_Reflux_Friend_Info
{
	struct FString                                     openID_0_7639F3005900CBB86A73304B0B03E584;                // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                callReward_1_58A103803D5B9EE07B45935906D62BD4;            // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FString                                     nickName_2_077C4CC001F7E6B30F937A700AF91D15;              // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     headUrl_3_3ECBB4802DE28F764ED6BE2708E1E92C;               // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                level_4_00F669403191EAE17061A78E05B49ACC;                 // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                inviteStatus_5_1AFA08001A47C3EA7B0DDCA8000A3C33;          // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     uid_7_017313C00239E12F7F41F6750675BDA4;                   // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                weekNum_8_69143A401B68A81F52A8E4740BED900D;               // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
