#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_OfficerTrainingBoxInfo.BP_STRUCT_OfficerTrainingBoxInfo
// 0x0020
struct FBP_STRUCT_OfficerTrainingBoxInfo
{
	int                                                id_0_5A403C40756785DD3546FACE0B4EC974;                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     status_1_3628F20040C833B20B4E43450821C503;                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                first_2_2469F300435C196E2A0E33610C95BD44;                 // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                sort_3_07AA7B0049D9C24464C0D2880EC82DD4;                  // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
