#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Shop_GiftThanks.BP_STRUCT_Shop_GiftThanks
// 0x0068
struct FBP_STRUCT_Shop_GiftThanks
{
	int                                                uid_0_78E6C8C072D722593D1B15300C161884;                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                avatarBox_3_43DBE240133F9DC9209E94A304BE64D8;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     iconUrl_4_15BA2F4057A7DEFD43E32A2F0CFA2A8C;               // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_6_0036558058A5D90E54EFCEE900ED8BA2;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                intimacy_7_3A1C2FC012B064E97F095D39026F5779;              // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_8_46B100804C1B3EDC0FB43E74016171F5;                  // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     date_9_5374DFC04AC873CB0F8777A501609F65;                  // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     message_10_1D2171800EE1A5F45EAB5ED500B681C5;              // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                read_11_5FCAFF407D5F0AA70FAF5E7A0161BCB4;                 // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                index_12_24B3BE4072486FD315C50038060D36D8;                // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               inited_15_52E27780047DFEDA4BD377CA00D4CBD4;               // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0059(0x0003) MISSED OFFSET
	int                                                shopid_16_68677A001D455FE078C2AFD401AAA794;               // 0x005C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_17_2039240002D955B40FAA02C401613D7D;                 // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_18_44951E401970D051169007D60611B0AC;                // 0x0064(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
