#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_PersonalBasicInfo.BP_STRUCT_PersonalBasicInfo
// 0x00CC
struct FBP_STRUCT_PersonalBasicInfo
{
	struct FString                                     role_nextlevel_0_FBE668954EC01EF93CEEA8BE345582C5;        // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_image_1_4077D3AB4D30BA5669738FB9D7A6A53E;            // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_sign_2_11FB47EA43CA86DE317E6880E40C7FB5;             // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_sex_3_671DAD7B425D424F901AEABE96C1F444;              // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_curlevel_4_52FE0B22460736156A4C57A35DC068AE;         // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_curexpnum_5_B751043644F0E7CAA1B8CBB1C42B4AF2;        // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_id_6_349344534B3D709D9E18F794879B5369;               // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_name_7_87BB4C20401337DF16F099A3FA5E166E;             // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     role_needexpnum_8_6F9979D647E7E96944E7A69E5A6D1E33;       // 0x0080(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                role_curlevelnum_11_EA961B664F8B79ADEB6976942E95CFE4;     // 0x0090(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_nextlevelnum_12_AAB877C6467A23CD271CE5BE6D9F04FC;    // 0x0094(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_segment_team_13_A33E2C4D40E5B63EFE6B1EB918CE9D64;    // 0x0098(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_segment_double_14_40091CBD4447C6A11C56F4B36C1AFEDD;  // 0x009C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_segment_solo_15_D8AE4BAC44F2E13CBC152796603FEB29;    // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_segment_max_16_0A8835BC433B7923C68452A8D9103ED1;     // 0x00A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_qqvip_17_A5D6675E4F95BDC61B2AE990627FDC40;           // 0x00A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_avatar_frame_18_9AD9FCFA4148267A1D42F097FF5C4A42;    // 0x00AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_startup_type_19_BFB4BEF54E91AC0FB68948ADF86BBB76;    // 0x00B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_credit_20_394D4CC0335CE7AB71F9EE9B03AFE484;          // 0x00B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_corpsid_21_3B89CB00127C036615125A960A1CE1C4;         // 0x00B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_segmentFPP_max_22_06250D803E8C1F44650D4DEE07D02698;  // 0x00BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_segmentFPP_double_23_573FDAC04501A8F73E374DED0207C625;// 0x00C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_segmentFPP_solo_24_7A712B4032C0778F3FE5A0150D02D55F; // 0x00C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                role_segmentFPP_team_25_697EA5C0387D58FB3FF792AC0D02FA0D; // 0x00C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
