#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_WeaponBPTable_type.BP_STRUCT_WeaponBPTable_type
// 0x0054
struct FBP_STRUCT_WeaponBPTable_type
{
	struct FText                                       CName_3_CD600C314161E84152102388BAC2C6E5;                 // 0x0000(0x0018) (Edit, BlueprintVisible)
	struct FString                                     Path_1_4B3A115440CA4D3ED6BB1CAE5312F1D0;                  // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_CE3ED80D47C51A8880AD2CBC79F2E6D0;                    // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FString                                     SkinSkMesh_8_0AE836E041AC51D1B570EE8F876EAA14;            // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     SkinMaterial_10_B7BC5429449B61044D30639FEEF6957E;         // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ParentItemID_13_71DAC0B941B50807B67A5E86CBF0F8FF;         // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
