#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_Shop_GiftBeg.BP_STRUCT_Shop_GiftBeg
// 0x0094
struct FBP_STRUCT_Shop_GiftBeg
{
	int                                                uid_0_2AC292002C4C1DC07DA86FC5046A88F4;                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                avatarBox_3_4583EB803D8DA6E25A104F800CC2F4A8;             // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     iconUrl_4_4E3378803D4D30F83A00C1EB0CA2561C;               // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                gender_6_79903EC06C11022F1416C16F09EC0C62;                // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                intimacy_7_5804D9006D41B57649CF87FB05EA9E79;              // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     name_8_54BC29C001F0C26509D816B706AA7875;                  // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     date_9_6180090061ED1D3E09D2075206A998E5;                  // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     message_10_559ABAC0186BF95B7195787000CEFD75;              // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                read_11_6DD628801718A1D009DA809006A8BB34;                 // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                index_12_2D3E47804CE97B942EAA15D40A9D4EA8;                // 0x0054(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                style_13_5E25EDC0782C0D8D3429C09D0A89BC45;                // 0x0058(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               inited_16_4C3C60C0338F006178C0167809D54C14;               // 0x005C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x005D(0x0003) MISSED OFFSET
	struct FString                                     notice_17_0BB4A200748395D62284EF7E0A86E935;               // 0x0060(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     give_type_18_0D3D5480352778625B3BF23E08DC3F65;            // 0x0070(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                shopid_19_61C16340580F8A7720D8723E08AF2054;               // 0x0080(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                item_20_2E444D4051731CCF0929C3F706AA3AFD;                 // 0x0084(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                level_21_4D1FA7805E1D4B28342F8FB10AA1C8DC;                // 0x0088(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                relation_22_06FE990042EF3B0047F197EF0C6E08EE;             // 0x008C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                gived_23_1BD7A5407EACCEEF34CA46CE0A9F08D4;                // 0x0090(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
