#pragma once

// Name: LitePC_0701, Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass CH_Base_AnimBP_V2.CH_Base_AnimBP_V2_C
// 0x2D44C (0x2DD3C - 0x08F0)
class UCH_Base_AnimBP_V2_C : public USTExtraAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x08F0(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3E0DC96C4F492E33A68012A76490D2EE;// 0x08F8(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9729D5EA4BB38A89C6E440B3284F244E;// 0x09A0(0x00A8)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0A48(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_334E7F0F4E2C7E53F84BB2AB3016A943;// 0x0A50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32375D8140D311A483618C8BA6F3E4A2;// 0x0AD0(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7F7935B24BECFDAF375EAAA20BB8ABC2;// 0x0B50(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_68A616AC459AC23CBEC83DB3AA419386;// 0x0C78(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_17A905274329446917A8F2A62DFDDC7E;// 0x0CC0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_71BBFC7C42A28FC5B0E74C91C6D6B922;// 0x0DE8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_12424B8640F74EE7A133E4A9137FAA36;// 0x0E30(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B35E3A25415363F4BEBB77A5D95B3F24;// 0x0F08(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E463F53A4BAA07264B2E8B9688213847;// 0x0F58(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AEB190BC42AFB7D267C2E3BC8393BCA1;// 0x0FA8(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_CB5A5249438F72D7267694B50510B065;// 0x1050(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C083BD6845DF5B3F98B85886B9050C17;// 0x1120(0x00A8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_644FC29742CC19A653D779BD607CFE5A;// 0x11C8(0x0070)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_90C37A6D4215F6A00576E6A331E0602B;// 0x1238(0x0078)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_40628577412510D6C251E18783C8FC21;// 0x12B0(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3FBEF4984D3E2020D5D12C89808087B7;// 0x1358(0x00A8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_29A8A641498EA842037596A93FF6F617;// 0x1400(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC50D5A94B09F5520BF6E0BB38928D26;// 0x14E0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9BB9CF7E486F2FBD176C06A78A5FEC73;// 0x1550(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_235B18C94223E241E85C4B8F280D8742;// 0x1620(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_61C7EBF9486679AA834E918ABF45F7A3;// 0x16F0(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5AE81626403356802119BEB8E42E088E;// 0x1740(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_8391397843E97D159ED424A3F2004B95;// 0x1788(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_5FD59C2447E5B81D243151BDF12E4377;// 0x1840(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_938A67FD4D3C8BE641B5869642BDFFCD;// 0x1888(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F07DDD2B4217E5EA3B703CA63A12695A;// 0x1930(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9D36215A46F59CDEBD2C14B3B6452E34;// 0x1980(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D21B1560441EC99CAA154AB4938217AD;// 0x1A28(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1ECBAFD140E849B4CA72BDB7C8DCC709;// 0x1A78(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0FD00C764E4400BBF39507BED09A2F6A;// 0x1AC8(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2225404B4935A3D9572DAF90D4ADE078;// 0x1B70(0x00A8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_760D59C245973DA1B51BE9B7E55A895A;// 0x1C18(0x00A8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FC4A9F2D4A8645D2B132ECBD81F947BC;// 0x1CC0(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_74094C6245EBB941B5543A81856F0A92;// 0x1DA0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_FD5105934569DB9C0C72C9A344C9AB2B;// 0x1DF0(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3E31151C4A4A74D0766BDCA66FDC8AD5;// 0x1E40(0x00E0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_23A368D1472AE9BFACF5FFA059032E75;// 0x1F20(0x0158)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_84EB5D43427BD0150D76EDAE934AE82D;// 0x2078(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2C6A092A4287FCC5D80BF9BA0E7C63B8;// 0x2120(0x00D0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2AFFAD1B4B003FC2B26BDDA9215C8B78;      // 0x21F0(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B55EADF94DCCB72164EC71A616EABD8E;// 0x2258(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D70E7EF840918DF7DA809FAEEC4B9F66;// 0x22A8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D1FE84F744E8FC477B8D25BEA111CE3D;// 0x22F8(0x0050)
	unsigned char                                      UnknownData01[0x8];                                       // 0x2348(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1070E1C6411D163A43AD3FAF402B4052;// 0x2350(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_161FC4B64FA0878018F136B272B569B7;// 0x23D0(0x0080)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_75D25F4D43E5F19D6449328D1ABF82E9;// 0x2450(0x0158)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_927C217444999069B10965BEABDBFDBF;// 0x25A8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5702AB1B4C76B5CFE12244A8E0B6E275;// 0x25F0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DCD73E0846DE482B4EA226BFE2D7584B;// 0x2638(0x00B8)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_A31892CF4E4FD2DF5E3EEDBD47C6AA65;// 0x26F0(0x0060)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7BD454FE4C83C0E6F8FDFA920CE7F9D5;// 0x2750(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_435ED70E40AE313A67D6C286437BDB86;// 0x27D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E60F844C421B789D60A6E0BE3C721A51;// 0x2850(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C35F9054EA93BE2F27C23BEC010D672;// 0x28D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A76374F641CA758EF7CB72926DFB41EA;// 0x2950(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6CD4DB8F457A9DDF0D74B19793AD6622;// 0x29D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E60709B448F71F52858C57AE76AEA798;// 0x2A50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7006ABF147CB5012A83E29BDF8AF8347;// 0x2AD0(0x0080)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D6E9FE66433529F667598A90FDF555E8;// 0x2B50(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A64959C348A70EC6811463B6D0486BC7;// 0x2C20(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E429A65944C3DCC2010C3395BFDF1123;// 0x2C90(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DEF88C7047FBE14204A773878BD655DB;// 0x2D00(0x0048)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_3B60110E4EE905554CD41FA830495688;// 0x2D48(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_51AC014C499E6441F7138EA0CBFB7FEA;// 0x2DA8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F70D58748BE77850E27E0BAA35C4BE2;// 0x2E18(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F0AE4315454829F6FEDA34A1171043DB;// 0x2E60(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2C1F910E4DE77F0B7A8625A4B8FF2DC9;// 0x2F88(0x0048)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_3E3D98694ED93E4FAAA19896F05AD5B7;// 0x2FD0(0x0060)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1C09164340A1103191C413B293BB202E;// 0x3030(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_811CE95B497959D52A3B7CBC29137A06;// 0x30A0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_16B18A424326EAED3B7166ACE2957F05;// 0x30E8(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E8EB2E41449385B13DD545AE86F5D783;// 0x31C0(0x00B8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CBBF35144A405213192A0B9C5257409B;// 0x3278(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_7B3F03C44A8C1ED179CF0F8735373107;// 0x32C0(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7A138C294959C60350E9A59EFB6BD1E2;// 0x3308(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_39507155453CF851AF834CA28B33E7A2;// 0x33C0(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E2FFEDB047D3E20A1CC41DB6A1F75FDF;// 0x3478(0x00B8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B50A12C24F319F9949A49EBA669D5697;// 0x3530(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_983A76DC43C37831C285C3B01B40E0CA;// 0x3578(0x00B8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3DEFDAB1450ECF671E544680B3602535;// 0x3630(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_59F6C9BD4BE82B112808ECA98CEBD950;// 0x36B0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F5829DC04ACD07BA723A3BA007F1F5A7;// 0x3730(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CAE6BF0C4C48BBF9D43ECA914D7FC227;// 0x37B0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1AB03DED43CDAF7599895A9FE05A1CC6;// 0x3830(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DE5549E04A62262759FD67BAD0DD4405;// 0x38A0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9005F8204B64C6272D69E4BF0C291EA8;// 0x38E8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_8CC3CA3C4C3B944DC89E42A82BB53617;// 0x3A10(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F639727C49D12F3BB4A9CBACCFDE32A9;// 0x3A58(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3998325747BB9F641F68998A60598756;// 0x3AC8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4CA5289E41B0CE9260C9E0BBE092E0AB;// 0x3B10(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5E669C824F9A881F0EAE73BD7868A057;// 0x3BE8(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A270A0A746D4B3EA410DB7A631E136BD;// 0x3C30(0x00D8)
	unsigned char                                      UnknownData02[0x8];                                       // 0x3D08(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB622DC748C41C1F460410A802B2A36E;// 0x3D10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2EF175E545692D486A24C0A4C8255533;// 0x3D90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CAB5E5D944B23B5239F43EB0AC73BDC8;// 0x3E10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_467EAF8D4AF0FEEAD8CEB487BAFE42FD;// 0x3E90(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4A42624046CF5BA9FC995293CBAC118E;// 0x3F10(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3020FB9D4077B3BF58A1CCAAA931A2D7;// 0x3F90(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BD2576E545963C95BC73E18A209F6AB3;// 0x4010(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BC56CA8A4847841604D4B1BDABCCC3B1;// 0x4080(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_161AEA454EAB6C08452831927FA5C0B3;// 0x40C8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_5B90B3CB4E58B3323EB9289E4F69F00A;// 0x4138(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_0B970FBA4CA8130BD940729A16A8AEFD;// 0x4180(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_138A9CC84A43120A1B429BA06E94413F;// 0x42A8(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_A28682DA4A51EF91A535F8A8BEEA630D;// 0x42F0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_433088244B94FBC975F9CABE53C93E18;// 0x4418(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AB73E4AF4803F690C3AB5EB0D034E148;// 0x4460(0x00D8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_6BDCFD144122A64F39CD07A242794E8D;// 0x4538(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_05FD887B4E03009BF4E59FB3FF20E009;// 0x4618(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_624C581A477A33F305C939A241FFB163;      // 0x4668(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0BC1905C45D508E8B1C5E5BAFC32E7AC;// 0x46D0(0x00D0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_437F6958424118E712FAC08B1922D20E;// 0x47A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_486AE55148C7BCC04ED6248043DA8357;// 0x4820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9CB3127347B6BF848E9503830EE1E329;// 0x48A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F88092054D6A61C5ABDB4D91CAC63F1F;// 0x4920(0x0080)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_57B0B5254103210063A4D191A864281B;// 0x49A0(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_930783F34B41BC7E0B8FEFBE4A2BEA2C;// 0x49D8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_080DECAB41F0ADF9A799FBA96CA52188;// 0x4A20(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6CEA38D24CF2BE5390114EA111729F55;// 0x4A90(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_18AB15104402D34E9EC4518484138B15;// 0x4B00(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_173435264D52A185DF6B40A7C1F416B3;// 0x4B70(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1E5C556448A6F20680ED00B9583FFAD2;// 0x4C50(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0682A61049FA6BA6EC2F949E7D8C9921;// 0x4CC0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A9431A6042FF82E1407E80B38ABEACF1;// 0x4D30(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_604ECFE4430F1D582C6A9889732659DE;// 0x4DA0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3FEDE94641D32C0157A449971DA5EB08;// 0x4E10(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9096A19C45F817C932FA08B41240FB24;// 0x4E58(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_1DEF4A2640C6BD26EF0DC0B06D3F9072;// 0x4F80(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_85821A78426DFA68AC6993AB344B47DD;// 0x4FC8(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FD4175234FC00BF4EC4979AB324C3A1E;// 0x50A0(0x00B8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_367E7B7F45C3A33C27563C92D4227730;// 0x5158(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3E0F913148669023398BA59748686E56;// 0x51A0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8620A9B843A97256C5FB11B205F25664;      // 0x51E8(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_CDDDCD334AEE83318C5AE0988D99E5C2;// 0x5250(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_035C4A3245023DB8F47177A310C64DEA;      // 0x5330(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F5D95DF14C8695E829C1B7B824A46F72;// 0x5398(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C87A03684A6C44105480ED8D9B2A97E8;// 0x53E8(0x0050)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EF1CF4BE4EC70221956A7EA23FAADE77;// 0x5438(0x0128)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2A29A7AB464C1A1D575B63B418DA8AEB;// 0x5560(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3B70119F43C92E264161298C378ED3EE;// 0x5608(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_851C3010491D39E87057E185A49E56C1;// 0x5658(0x00A8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_669E1AA14018C41D58D983978CDDD59D;// 0x5700(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B424F06B428EB2BCC15895BE6FFA0A3D;// 0x5748(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5578B28841EC550DBD8D40A309791855;// 0x5800(0x00B8)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_1DB06C604F7E246614BC78A9953E6D28;  // 0x58B8(0x00A8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F753FF914516926BA121EE9FB02EC23D;// 0x5960(0x00B8)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_517DFBEE456897100B2293B9E1284EA0;  // 0x5A18(0x00A8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DFD2B56544C0E4459058D0A3C726BFAC;// 0x5AC0(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7634E7844B2ED32FE3BF3BBCC3009D1A;// 0x5B08(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9AE0113348FC81DD5F3A0794C80E2F05;// 0x5BB0(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6FA440814D1A705559680FA32629D3A6;// 0x5C00(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C98BF27B4054D719C8A2E2A55F922163;// 0x5CE0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DD98316A43F846CA820D4D879DCD483F;// 0x5D30(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6C4124FE40FD113714AF4889E7AC3455;// 0x5D80(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D7E1A08A40C849E9DE07BBBD93C10637;// 0x5E60(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_39346D734E080FE7212F45994E77C8FA;// 0x5EB0(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DBFEAB20488E9B58685A24B2C57F1605;// 0x5F00(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9042EA9B4080F283350D88AFB8688BA9;// 0x5F50(0x0048)
	unsigned char                                      UnknownData03[0x8];                                       // 0x5F98(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_AF0FCF5D47B044D61B785D9BC27F8581;    // 0x5FA0(0x0170)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_2CCE257B43B01134AD87CB817AED6647;  // 0x6110(0x00A8)
	unsigned char                                      UnknownData04[0x8];                                       // 0x61B8(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_298E349E46868A22FA81BD9499193329;    // 0x61C0(0x0170)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_78ABEE4745B6FC47080400A1AC28B0C0;  // 0x6330(0x00A8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_E1306DB64CC26247D8ED288D5E301590;// 0x63D8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9C9E66504C4F7FA6B377CB95BBB390CE;// 0x6420(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E2B2C63042DED7B3EB2359A82B0CDFAA;// 0x64C8(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_12DBAB6E405143717F9D8E8C54CCD78D;// 0x6518(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D2EABF4345ADCE088B7836909141ACA4;// 0x65F8(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_FF2B04604B69E883F28FF8B4B0B86FD0;// 0x6648(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_C840498F41E327D63A3C28BCE568160D;// 0x6728(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6D0008C14D03FF770B84A5B023E0C207;// 0x6778(0x0050)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_9AE0915D45BF0CB0D3378F9224B765F6;// 0x67C8(0x0048)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_89A5ACEE45F06BDE26AF019943080CB7;  // 0x6810(0x00A8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C496B6134E19D1E24D83C1868852FE25;// 0x68B8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E4F7090E4363FCD89D5964B07AE8663F;// 0x6900(0x00A8)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_17FE16B340178FDECADE8DAA0613EAB9;  // 0x69A8(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5568B5EE4A3C8C2AEFCD4B810E239359;// 0x6A50(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_11789816426C63991507DF81FBAF25AF;// 0x6AA0(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8D80BD6C4802A39197588EB0D7751EBE;// 0x6B48(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_31C9E0244B8EABACFD77F5949E24C244;// 0x6B98(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C7C583804B5C5D20B7B16EAA9C343A18;// 0x6C68(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_1D11770B405E8C4AABBBF09DB28C148C;// 0x6D90(0x00D0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_6EB1770941F224E44C88EA8FF7C809CA;  // 0x6E60(0x00A8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F0EEF61941AE3770A2F812883C762AE8;// 0x6F08(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_926EB36F4A423BF90CB1489F8874230F;      // 0x6F50(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_93E6BF8C466F043F384A88AD01CE1CA9;// 0x6FB8(0x00A8)
	TEnumAsByte<EFreshWeaponStateType>                 __SUBINSTANCE_WeaponState_5FB64A0B4A1CF3293861CA8EE5227C40;// 0x7060(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x7061(0x0003) MISSED OFFSET
	struct FVector                                     __SUBINSTANCE_MoveDir_5FB64A0B4A1CF3293861CA8EE5227C40;   // 0x7064(0x000C) (IsPlainOldData)
	bool                                               __SUBINSTANCE_Scoping_5FB64A0B4A1CF3293861CA8EE5227C40;   // 0x7070(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x7071(0x0007) MISSED OFFSET
	class ASTExtraBaseCharacter*                       __SUBINSTANCE_OwnerCharacter_5FB64A0B4A1CF3293861CA8EE5227C40;// 0x7078(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FAnimNode_SubInstance                       AnimGraphNode_SubInstance_5FB64A0B4A1CF3293861CA8EE5227C40;// 0x7080(0x00C8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_93143D4049D7FCFA590EFCB561CF7863;// 0x7148(0x00D0)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_EB0560E545787528F907EF8C2ED6A169;// 0x7218(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6B387F6B4CAC41E6A1307E93E771BBF3;// 0x7260(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7C910F264C0DBA535EC628AD8BD611CB;// 0x72B0(0x00A8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_BB92C63A42C731BBB407ADB3568124FE;// 0x7358(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_231F168A4D890E1CDB81BC8420ADE6A1;// 0x73A0(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2692F9D84EB1538D7D7A9F93B58C8594;// 0x73F0(0x00A8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E406F360424728CF55BD80B53A3A8E6F;// 0x7498(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_ED6FAF964714AFBF0063A7BDF72029DD;// 0x7550(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_400B0D4F4B140AC8932AC89C336D6EAA;// 0x7608(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_27442E2B4081B8051303ED8265343F05;// 0x7658(0x0050)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_C3A28D9E4B811793BB13DB9BAD456089;// 0x76A8(0x00A8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_816E506948935C8F3827D4BB60818850;// 0x7750(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_14EDADE9421C32BF9FEE239DB3A6EBF5;// 0x7798(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_454FE5BB48598958FEDCF290BDD6A644;// 0x77E0(0x0050)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_EE0E4EB846D4C89F6348478DAC2DDAD7;// 0x7830(0x0078)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_15D43F234375806EC6E143B7D7EB828B;      // 0x78A8(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_CBBDABCC4A64E48135C80A8DFFF1AE6B;// 0x7910(0x00A8)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_CEED7BB54FB6DFF34C12F19B6A14BB20;  // 0x79B8(0x00A8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D21376C74E8079E2082A26AB56C4A6CD;// 0x7A60(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_51B301984B06B64DF1E186AA7B917997;// 0x7AA8(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_24B983BE4070D4A8DF9FB4BB68E1825F;// 0x7AF0(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_64ABE3F645B7B66B2C90B1846C2F7391;// 0x7BC0(0x00A8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_A7F5DC224807D5384CEC809540451D26;// 0x7C68(0x0078)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_98DD8F064097991B2AF81E9644D7CD06;      // 0x7CE0(0x0068)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_E953985F4858AFDC20C19093F90F7AE4;  // 0x7D48(0x00A8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_698AFC4B4412E94B7AF858B0771A023C;// 0x7DF0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_D5F675844F1495E1F2DFCCB4BBFDD845;// 0x7E38(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_A889643D4679E032F2EE3A93EB14D77F;// 0x7E80(0x00A8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_92A1AC11409580C01894DAAE1A346BBF;// 0x7F28(0x0078)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_DDE6F55F46E5DEA11FB833BF31AB34AE;      // 0x7FA0(0x0068)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_374084604CB1454C9B3CBBB8CDBF3803;  // 0x8008(0x00A8)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B9AC273A4ED74EBBE185FCB36B5B8C56;// 0x80B0(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_B612139341ED40BA78049BAF485301B1;// 0x80F8(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_54205DF44102F3638C26109BF9E5DA53;// 0x8140(0x00A8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_33E033DB4B06402CA81221AD25694278;// 0x81E8(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A9FB05AD4BA214E8932035A6D9743BB7;// 0x82C8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_55A553CC4390A31C6B469CA3D1CD4E8E;// 0x8318(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_91C9E545464DCBC37F4CCBBE9F832E8B;// 0x8368(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_4FFB56594030DBC20E73F28DD8F71058;      // 0x83B8(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3AD16F12407598B0C7743BB593E3F791;// 0x8420(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A949600343DAA8822971D493A1ADD617;      // 0x8470(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F52C7EA44F206302CFA3BBA745F5D875;      // 0x84D8(0x0068)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_B088DD98493CD8C97FE2629BDF877729;// 0x8540(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_226F0BAA496CA3C104AB9EBC971627C6;// 0x8620(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_E86CB1DD49C0262DF1C48DB196AD3998;      // 0x8670(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_18D58F174869E507231B8298B07B7761;      // 0x86D8(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F6442DE8456064A11FEBEDB8E43E25AD;// 0x8740(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_AB6C3F0541C6E2915AB4CDB869DC162E;      // 0x8790(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_3D2264A4498D9EA9E05A40BEF36799A5;      // 0x87F8(0x0068)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3F188CB94C44EA23D78CB9A868FFC0A4;// 0x8860(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_70B1BB344CB7ADA1C5D3CC994517A7BC;// 0x8940(0x00D0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_7516B4A54A7B29637AB8E4BF523F2626;      // 0x8A10(0x0068)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_0B3E996445548FDF274F00989A6B2946;// 0x8A78(0x0078)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F50F38804D6334F54D23EDB8125D45D6;// 0x8AF0(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_B0180221488CB83752616AA52B1A2CDD;      // 0x8B40(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2A159ED04023421C9969679FA3DA412B;// 0x8BA8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_B930AE514015FC635F6C7590B6B1A55D;// 0x8BF8(0x00D0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_FFFE9F02416CF02E6FF821ACE1E74D7F;// 0x8CC8(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_66AA0E94489DCBC49367FB9FC8AC2574;// 0x8D70(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F560D6B94E72871AA38D46B620B1C550;      // 0x8DC0(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3F8A31F24404762C320AA2A880FE1969;// 0x8E28(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3295167841928CA5133AA2ABF4F18664;// 0x8E78(0x00E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D3C7E64E408FB9A79D5E1C8B46BDEAD2;// 0x8F58(0x0048)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_DB03626E4F397287673B39A7BA2C72DA;  // 0x8FA0(0x00A8)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C945E36D45F356990402BDAE202BA4F5;// 0x9048(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_80FB426443A4B70BE3F4628B92EDC399;      // 0x9090(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D41229E446708AE4A42356A0816B1538;// 0x90F8(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_7330440349ECC6701F2CEEA08B8D0670;// 0x9148(0x00E0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_498F23944442121D49C33ABEF2DBD4FD;      // 0x9228(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_97AA0E324D0BEE4611AC68BB3A1556B6;      // 0x9290(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_EDDA462E4D2E4EC5DFE6B095C2E67EF3;// 0x92F8(0x0050)
	unsigned char                                      UnknownData07[0x8];                                       // 0x9348(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_02B30AC24A6E22EB3E1A199B2130C302;// 0x9350(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1B9BC9A4D12093731E866B3E3F0E113;// 0x93D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E331CF3646D71F0C50C815893E39FA12;// 0x9450(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D08F3484D89169D563433A5CE0F1C63;// 0x94D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C40D891C4C1D7B95CFD8B299D237451A;// 0x9550(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A76DAA3147E20771AEDE8C85E93831D1;// 0x95D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1A2BE7474D0A2A3C02B15CA832DDBD84;// 0x9650(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35593A894F2316441A09EDB0D4843BC2;// 0x96D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9B8898FA43EA4CBEBB09FD838B92C593;// 0x9750(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0432855B4CE723B0D7949A82DB88B50A;// 0x97D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13D730A14FC9B44753323489823B2AFB;// 0x9850(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF50422048AED9BFA630BA829C665EBF;// 0x98D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AB989414312B5C996441B928326EFE9;// 0x9950(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3A12694D4F556E6CE8ECCCBEF9E10CA1;// 0x99D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EBDD139C4B0C9CBFCB795BAC470A75D4;// 0x9A50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_39543A824469EF5E6E89D787D235BF02;// 0x9AD0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B1BB7E464F87DA9039342DA92B6272F3;// 0x9B50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_024A226A4A1F571D43094AA4FB101085;// 0x9BD0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0AA0F82546EF8ABBF00E6B9B8A46EFA7;// 0x9C50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB6C24A34200052C59DF12B57B68D6A9;// 0x9CD0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4371F56B45EC89419480049247D60890;// 0x9D50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A847D29644BFB537781C68AA0D56B7E6;// 0x9DD0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_E134AB6640E2A8A9B278ECB84473A04F;// 0x9E50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6A652932424B8ACB6F72B49B4C931368;// 0x9ED0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B47990D5403C8F8338E9A490EE509AC2;// 0x9F50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D228CCF1446529F2E2E2C6B585665D11;// 0x9FD0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CFC6469245B352BB6EBFE6A837359136;// 0xA050(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F302F1CA430DB0A6E3D0E8862F47EB03;// 0xA0D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C0B382CC416F9D7063F8008F8E3268C5;// 0xA150(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_61C5AE544D8B2C533D509AA472A64C65;// 0xA1D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9481B2414940F8E7232E26B73407555C;// 0xA250(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_90E2A866451529581064ADAE5F854BFD;// 0xA2D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D39574FE4489E90084B9BF8B003CB1FF;// 0xA350(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DEEAE90643F279B55581429BB112808B;// 0xA3D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4AEC7E44679A2977EC1F59D90D61C7F;// 0xA450(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C993F7EE46843F1B1B3D6CBCBE6644E2;// 0xA4D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_ABDC10E44825E21D38269E96F0F1CD09;// 0xA550(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B722FEBB467A31613635588D82E69D83;// 0xA5D0(0x0080)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_40504E474AD935E02F42689C1B651FEE;// 0xA650(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_D539E38246FD3BED8D485DA5F5901B41;// 0xA778(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_0AE80DBA4D9C009FA498A5ABC2BC5C03;// 0xA8A0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_3DE72C79468AE28A2D02759A150F0173;// 0xA970(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F281D40E4AA02919CD1B1ABBFBC87955;// 0xA9B8(0x0070)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2C52A74D4991D91DA5273FAF4E685AA1;// 0xAA28(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D9D6ED2044414554D2F4FEB8C6A1FAB6;// 0xAB08(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5ADEDF534AAE901104E06FA92C1AB3E2;// 0xAB78(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FB5B9F8D4BD59CE8CD8C0DA5955ECC91;// 0xAC48(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9886DC9F4D6FB9E1BC9C3DAFBC7FFBA5;// 0xACB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6577F18B4DC1052BBCB27DA7E886F429;// 0xAD00(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7A29BD3646FD5C55BBF7FBB6D4995795;// 0xAD70(0x0048)
	struct FAnimNode_RefPose                           AnimGraphNode_LocalRefPose_A5193627480E8E3AE8042C96E2E8ED9A;// 0xADB8(0x0038)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_0DBAD87647390D198C6F039EC9CB1005;// 0xADF0(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_033B655A4D23A9993D8B8CA52BEE3746;// 0xAE38(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_BCBE79D34B3CD7CEFFDD1588B3A90D50;// 0xAF60(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_6AC556074DD9876CF6E1AEB94A1C76AA;// 0xAFA8(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DB27C237418912323FDA7AB063662CE2;// 0xB020(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_49F19AE447CD530A11A1C2B8FE5B455B;// 0xB148(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_E0CCCCD44BEFC029EC6F2E9285D67A1E;// 0xB270(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_160037EC4719FC3B96515284F3E30665;// 0xB2B8(0x0078)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_DF0FA0374426B3BFC8FD4BB5751EBDEE;// 0xB330(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_71CF38134267A86E9D80EDA790BF1763;// 0xB458(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_AD98FDF341F58E09715F4DAA66E2D1FB;// 0xB580(0x0048)
	unsigned char                                      UnknownData08[0x8];                                       // 0xB5C8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_73A4EFE4406A3CA51C68C6BE960A1CA5;// 0xB5D0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D24C0FB047A814BE94C4C180C11C1ED3;// 0xB650(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_67AE4F2447577E747CAFB0894339D941;// 0xB6C0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_151012BD474E4D5FFCFB11BCC317035A;// 0xB708(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_990BDA68433DA405862D4C8AB6D6F71C;// 0xB778(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C1F92CEF413FFCEAE0064D9446F97FC2;// 0xB7C0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F365D7E84D8D600A2CE92FA15E24A076;// 0xB830(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_509878BB426295AD4E995A919D0ED1CA;// 0xB878(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_39AB313E444877D4F20CE1952BDD7673;// 0xB8E8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_822493014CE50F36BFD69A8C34D9A4AD;// 0xB930(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9F7C565849C384DB273BC88B8A3E0438;// 0xB9A0(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_446B148047AC1A4A0E2677A17CF5B63F;// 0xB9E8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_D286F2E045701BE573D0FE841214C306;// 0xBA58(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BF4D3F8C4A1F7B4D3A820B9C2F0F89B4;// 0xBAA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C594910740ADA7D66A9C3095E7C443B5;// 0xBB20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1239C4BA4585B3A8C5C1558F01322527;// 0xBBA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7467171D4CDBE3E8C9E49DAA86AAE298;// 0xBC20(0x0080)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4E3F58554F179471907879B45D34C1D2;// 0xBCA0(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_E54156EA4DBEEF51B8628887E92E8CC0;// 0xBD10(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_4B0210C14B92D5FC4067308D10E7CC45;// 0xBDF0(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_333FAFE94D90619317160AA0C56FED18;// 0xBE60(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_DBCAEA074E31BCD38AA320B9508C4E86;// 0xBED0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_328A43254A70F72E15ADA0BF6F2210D3;// 0xBF40(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_3D42037C4571549FE9A3B2992B669886;// 0xBF88(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_9BC032DC49E0A444E906F18EF432977D;// 0xBFF8(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_5E77BC744FDC679C99919FB81F6D4D39;// 0xC0D8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_BD13B3154177E407D70FFE8BDFDB5E82;// 0xC148(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8B33679D473BE597F38B02A27317E61A;// 0xC1B8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C8F36415441A7796A8BA078EBA1F486F;// 0xC228(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7B5FF5444C47749C63DA5B83BD9E4C77;// 0xC270(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7409C1C742E993F3500D5A89573BB6D8;// 0xC2E0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_32CEE1A94249CA17439A148F10410211;// 0xC3B0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_50A3A71049E3D385638BA88EA9D4D763;// 0xC420(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A45B8204FA13CA2676F5491A6A65B49;// 0xC4F0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_34C6D72A4C706377D9CA0B81C818D8DB;// 0xC560(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_80A7814542DA45409D1267B8E794B249;// 0xC5D0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9A25743342D7950E7A2D35BB59442A23;// 0xC640(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_397A90B440E0C9CC46B77FAB634687D1;// 0xC6B0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_29040D9149D7BC1A8DCF5990078DFAFD;// 0xC780(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_EA082EB3476549ABD2C8F5954528788E;// 0xC7C8(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_CB027A1F47C5519C47FE5D9EAE1E0B26;// 0xC8A0(0x0048)
	unsigned char                                      UnknownData09[0x8];                                       // 0xC8E8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9756B7BC412DF2FB2F4C08B7EEAC349E;// 0xC8F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19F54F7047DBAF6144AA6D961EB5C7CE;// 0xC970(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_BEC8670C40C6E2A54C59F8B0E4C25A4E;// 0xC9F0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_04B2D7A645B9587A017E8B9AE3067F58;// 0xCA70(0x0080)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_3A60608D48BA7AF2389454830E8AEED4;// 0xCAF0(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_4CE4591C4108FFD5FF783395EE2C9518;// 0xCB60(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_54585D7B47EA0531A732D59198A17FBC;// 0xCC40(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_62F7F8A44D24E4FCFA60E799AA08FA07;// 0xCCB0(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A2B76A084F4CA4185632C687AF36E78F;// 0xCD20(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B435621E4157E8655588A5B3146D754B;// 0xCD90(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_A179470449656214D2EEF0811DDDE62A;// 0xCDD8(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_65D9A3BF4E506D76C34A27A19FD199F6;// 0xCE48(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_65197DF542A95896DBAB14AD824FBA4E;// 0xCF28(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_E54478614739D58965B4B19508C15733;// 0xCF98(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F2E35FD549766BBD890FF2ABB9DD7E49;// 0xD008(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_A93864064A9D54AF2EB1A490D59748EC;// 0xD078(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7D88809641BCF91D817BEC8ACA940D63;// 0xD0C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6961DBD494BB5372AF5FFA0A0A10A30;// 0xD130(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_242FB7F44890A8FCDCD233B135640026;// 0xD1A0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0BA07D8544784008797B6786F6E8F9C1;// 0xD270(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14B1323B4AF095CF764F3888D49B1881;// 0xD2E0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6CE2B41342F7ED7C3EEAB0BDA990A337;// 0xD350(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_89903549468BCDD587EEE3A0615F960F;// 0xD3C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FC5CC7EE418A759CED73D48527A26E7D;// 0xD430(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_7E0557C841053A3F1A2BC9AEF4AD2805;// 0xD4A0(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_AC9ABC6F4698D18ACDC5D98A342B6EBA;// 0xD570(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_55D63F004E233D6F0D90178FE7C4C02C;// 0xD640(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_BFAB265740C9FAD9FDDA97866F62A157;// 0xD688(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F0925CAE4E9D1AA66228D6B791C821B4;// 0xD760(0x0048)
	unsigned char                                      UnknownData10[0x8];                                       // 0xD7A8(0x0008) MISSED OFFSET
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CD4B58E04E755F16F23A4099304BC473;// 0xD7B0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB10641F4F8F748802739A9330996F0A;// 0xD830(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_68C729D745DA9556880D87A35186B5F8;// 0xD8B0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0DB7D8694B407C03D1CE2698D0258A5F;// 0xD930(0x0080)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_1C536039496E7A98E980ED9623320661;// 0xD9B0(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D8B79F5542B80387BF9C939224A341A9;// 0xDA20(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_8D32E19B4ED0BB52F9B45FB3CBE352B3;// 0xDB00(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_2498BC254F55696A50342F800CF38C5A;// 0xDB70(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_FA14174C424B1343087634B5BA8F74C4;// 0xDBE0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DC0F3C814A10F2CAA368E08AF30E3C3C;// 0xDC50(0x0048)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_FA85C4ED46E0E8E17B55A9BC6B3D1BC6;// 0xDC98(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_FDCAF59143421A4CD8C433B4F6D81DC5;// 0xDD08(0x00E0)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_F03844EB4CCC0A5B23F7B0A879C456B7;// 0xDDE8(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_45835FB840FA17E0F7A9EC91301DD16F;// 0xDE58(0x0070)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_DAA8291048521D218C322B8134400CBF;// 0xDEC8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_49BEBC0E4AF2D0F6D758809220CD6B9E;// 0xDF38(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F446D033451A4BDA344EACA9CB49B01B;// 0xDF80(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C77537064F2ADFA50E4B4F8880A9826B;// 0xDFF0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CC875F6B4DABC12EC4C45296AC1BF13D;// 0xE0C0(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C6AF840340A7E1A727E2DBA1AB4CE25C;// 0xE130(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E400B603421AD7AD6B651AAA5F97E6BF;// 0xE200(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BC06AF114FD09AE8FD1428A88F7669AF;// 0xE270(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_963FB12547CE074FB73EE6B95426676F;// 0xE2E0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_35A3637B45057D7B119F0790E81413E2;// 0xE350(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_3AC24C884EB612B65675DDB1E5B913CF;// 0xE3C0(0x00D0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_9AC82FCA441BD120D312F48F066E671E;// 0xE490(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_21E94E714CEFF5C3FDBAC7BC4EF7ED3B;// 0xE4D8(0x00D8)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_7140B6D34D8F09A5AEDC008A6F6213D2;// 0xE5B0(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_63A6E0834BF697B7116904A594D45E01;// 0xE5F8(0x00D8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83E82362412C4BBE14910BA9DD1D18BC;// 0xE6D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DE5C36B4480E5333CADD05AB78D29E36;// 0xE750(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3C677CD4447EFDF1C145E18C038C9DDE;// 0xE7D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27E06A464245C104C0B167B9F09A207B;// 0xE850(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9DC32F704687B588374D48821DEE0642;// 0xE8D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DB5BE8E2463339D17F4F00B75393A05C;// 0xE950(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_63E565C84235461F338831B8FBB58ED5;// 0xE9D0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_89F697B945BA90839B20F9AC3C7DED33;// 0xEA50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_880538404B92055E632767854D98B9EB;// 0xEAD0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83ED918B414C7DCDA4DE37A096F9EB0D;// 0xEB50(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CC7B7E0846420855378B32AEC8F23FB0;// 0xEBD0(0x0080)
