



// Class ShadowTrackerExtra.STExtraBaseCharacter
// //Class ShadowTrackerExtra.STExtraBaseCharacter
//0x15D0 (0x1E20 - 0x0850)
class ASTExtraBaseCharacter : public AUAECharacter
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0850(0x0038) MISSED OFFSET
	float                                              RefreshUITimeAfterSpawn;                                  // 0x0888(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x088C(0x0004) MISSED OFFSET
	struct FPlayerAnimList                             CurPlayerAnimList;                                        // 0x0890(0x00F0) (BlueprintVisible, BlueprintReadOnly)
	float                                              ScopeAimCrosshairUIScale;                                 // 0x0980(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0984(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCharacterShootDelegate;                                 // 0x0988(0x0010) (ZeroConstructor, InstancedReference)
	float                                              HealthMax;                                                // 0x0998(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x099C(0x0004) MISSED OFFSET
	float                                              TurnLinearEndThreshold;                                   // 0x09A0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SwimableWaterDepth;                                       // 0x09A4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bIgnoreInput : 1;                                         // 0x09A8(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData04[0x7];                                       // 0x09A9(0x0007) MISSED OFFSET
	float                                              FarRelevantDistanceSqured;                                // 0x09B0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              VoiceCheckDis;                                            // 0x09B4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0xC];                                       // 0x09B8(0x000C) MISSED OFFSET
	float                                              CapsuleTurnInterpSpeedLocomotionSprint;                   // 0x09C4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      FriendThread : 1;                                         // 0x09C8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x09C9(0x0001) MISSED OFFSET
	unsigned char                                      IsPeekRight : 1;                                          // 0x09CA(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x5];                                       // 0x09CB(0x0005) MISSED OFFSET
	float                                              MinTurnAngleHip;                                          // 0x09D0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bCollisionDebug : 1;                                      // 0x09D4(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08 : 8;                                        // 0x09D5(0x0001)
	unsigned char                                      bWasOnVehicle : 1;                                        // 0x09D5(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x2];                                       // 0x09D6(0x0002) MISSED OFFSET
	float                                              VehicleMaxShowDis;                                        // 0x09D8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData10[0x8];                                       // 0x09DC(0x0008) MISSED OFFSET
	unsigned char                                      EnableSprintSync : 1;                                     // 0x09E4(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData11[0x3];                                       // 0x09E5(0x0003) MISSED OFFSET
	class UAttrModifyComponent*                        AttrModifyComp;                                           // 0x09E8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData12[0x8];                                       // 0x09F0(0x0008) MISSED OFFSET
	TArray<struct FDamageCauserRecordData>             DamageCauserRecords;                                      // 0x09F8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	float                                              MaxSwimSprintSpeed;                                       // 0x0A08(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x4];                                       // 0x0A0C(0x0004) MISSED OFFSET
	TArray<class AActor*>                              InventoryData;                                            // 0x0A10(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor)
	unsigned char                                      UnknownData14[0x4];                                       // 0x0A20(0x0004) MISSED OFFSET
	unsigned char                                      bUseSameTeamDamage : 1;                                   // 0x0A24(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0xB];                                       // 0x0A25(0x000B) MISSED OFFSET
	class UCurveFloat*                                 Curve_TurningLerpLocomotion;                              // 0x0A30(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ExtremeFallVerticalVelocityThreshold;                     // 0x0A38(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData16[0x4];                                       // 0x0A3C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCharacterStartFireDelegate;                             // 0x0A40(0x0010) (ZeroConstructor, InstancedReference)
	unsigned char                                      UnknownData17[0x40];                                      // 0x0A50(0x0040) MISSED OFFSET
	float                                              Health;                                                   // 0x0A90(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    ScopeAimShootSpreadRot;                                   // 0x0A94(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData18[0xC];                                       // 0x0AA0(0x000C) MISSED OFFSET
	int                                                LocalSimulateStates;                                      // 0x0AAC(0x0004) (ZeroConstructor, IsPlainOldData)
	class UCameraComponent*                            ThirdPersonCameraComponent;                               // 0x0AB0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              MoveMaxShowDis;                                           // 0x0AB8(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData19[0x4];                                       // 0x0ABC(0x0004) MISSED OFFSET
	class APlayerTombBox*                              DeadInventoryBoxTemplate;                                 // 0x0AC0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    CharacterAnimEventDelegate;                               // 0x0AC8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UAkComponent*                                FootstepSound_Comp;                                       // 0x0AD8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              voiceCheckShowCD;                                         // 0x0AE0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurrentReticleShapeIndex;                                 // 0x0AE4(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	float                                              MiddleDistanceAimFOV;                                     // 0x0AE8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData20[0x44];                                      // 0x0AEC(0x0044) MISSED OFFSET
	unsigned char                                      bDead : 1;                                                // 0x0B30(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData21[0x3];                                       // 0x0B31(0x0003) MISSED OFFSET
	float                                              TurnNonLinearEndThreshold;                                // 0x0B34(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FPoseChangeTime                             SwitchPoseTime;                                           // 0x0B38(0x0018) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData22[0x8];                                       // 0x0B50(0x0008) MISSED OFFSET
	struct FName                                       EmoteSlots;                                               // 0x0B58(0x0008) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      bUsingFreeCamera : 1;                                     // 0x0B60(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData23[0x17];                                      // 0x0B61(0x0017) MISSED OFFSET
	float                                              RelevantPlayerAIPolicyDecisionLogInterval;                // 0x0B78(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData24[0x4];                                       // 0x0B7C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerHandFoldedChanged;                                // 0x0B80(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData25[0x8];                                       // 0x0B90(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerPickUp_Server;                                    // 0x0B98(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData26[0xC];                                       // 0x0BA8(0x000C) MISSED OFFSET
	struct FVector                                     NewStandHitBodyBoxScale;                                  // 0x0BB4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               ThrowawayWeaponSound;                                     // 0x0BC0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData27[0x8];                                       // 0x0BC8(0x0008) MISSED OFFSET
	struct FTransform                                  HitBoxLeanTransR;                                         // 0x0BD0(0x0030) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bIsWeaponFiring : 1;                                      // 0x0C00(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData28[0x7];                                       // 0x0C01(0x0007) MISSED OFFSET
	class UAdaptiveCrosshairWidget*                    AdaptiveCrosshairWidget;                                  // 0x0C08(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnCharacterAttrChangedWithDetail;                         // 0x0C10(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData29[0x8];                                       // 0x0C20(0x0008) MISSED OFFSET
	class UAkAudioEvent*                               SwitchFireModeSound;                                      // 0x0C28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HitStateOffDelayTime;                                     // 0x0C30(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              PawnBackpackCapacity;                                     // 0x0C34(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	class ASTExtraPlayerState*                         WhoKillMeRecord;                                          // 0x0C38(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                FirstDamageTypeSpesificID;                                // 0x0C40(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FPPSkillPromptRotationPitchMax;                           // 0x0C44(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData30[0x8];                                       // 0x0C48(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStartInitDelegate;                                      // 0x0C50(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData31[0x30];                                      // 0x0C60(0x0030) MISSED OFFSET
	struct FVector_NetQuantizeNormal                   LastAimOffsets;                                           // 0x0C90(0x000C)
	float                                              RefreshUITimeAfterSpawnInterval;                          // 0x0C9C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<ESTEPoseState>                         LastPoseState;                                            // 0x0CA0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData32[0x3];                                       // 0x0CA1(0x0003) MISSED OFFSET
	float                                              WaterHeightOffset;                                        // 0x0CA4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnDoorInteractionDelegate;                                // 0x0CA8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDoorInteraction_Server;                                 // 0x0CB8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              AttackStateOffDelayTime;                                  // 0x0CC8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData33[0x4];                                       // 0x0CCC(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerPickUp;                                           // 0x0CD0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bShouldDrowningHurt : 1;                                  // 0x0CE0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData34[0x1F];                                      // 0x0CE1(0x001F) MISSED OFFSET
	class UAkAudioEvent*                               AmbientSound;                                             // 0x0D00(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SpeedDynamicScale;                                        // 0x0D08(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData35[0x4];                                       // 0x0D0C(0x0004) MISSED OFFSET
	struct FTransform                                  HitBoxLeanTransL;                                         // 0x0D10(0x0030) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData36[0x4];                                       // 0x0D40(0x0004) MISSED OFFSET
	struct FAnimVehParamList                           CurAnimVehParamList;                                      // 0x0D44(0x0018) (BlueprintVisible, BlueprintReadOnly)
	float                                              AnimDeathLifeSpan;                                        // 0x0D5C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData37[0x8];                                       // 0x0D60(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnDoSomethingDelaySomeFrames;                             // 0x0D68(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    IsEnterNearDeathDelegate;                                 // 0x0D78(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData38[0x8];                                       // 0x0D88(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnHit;                                                    // 0x0D90(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData39[0x8];                                       // 0x0DA0(0x0008) MISSED OFFSET
	TArray<class AActor*>                              PlayerSlotData;                                           // 0x0DA8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TEnumAsByte<EMovementMode>                         MovementModeBeforeNearDeath;                              // 0x0DB8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData40[0x7];                                       // 0x0DB9(0x0007) MISSED OFFSET
	TArray<struct FHealthPredictShowData>              HealthPredictShowDataList;                                // 0x0DC0(0x0010) (ZeroConstructor)
	TEnumAsByte<EHitPartJugementType>                  ClientHitPartJudgment;                                    // 0x0DD0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EHitPartJugementType>                  DSHitPartJudgment;                                        // 0x0DD1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData41[0x6];                                       // 0x0DD2(0x0006) MISSED OFFSET
	class UCharacterWeaponManagerComponent*            WeaponManagerComponent;                                   // 0x0DD8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      bIsDelayingMove : 1;                                      // 0x0DE0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData42[0x3];                                       // 0x0DE1(0x0003) MISSED OFFSET
	float                                              UpWaterHeight;                                            // 0x0DE4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData43[0x8];                                       // 0x0DE8(0x0008) MISSED OFFSET
	struct FBodyTypeDef                                VechicleBodyDef;                                          // 0x0DF0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FScriptMulticastDelegate                    OnPreVaultServer;                                         // 0x0DF8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData44[0x4];                                       // 0x0E08(0x0004) MISSED OFFSET
	float                                              PickUpRadius;                                             // 0x0E0C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FName                                       TPPCameraBoneName;                                        // 0x0E10(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FPPSkillPromptRotationYawMax;                             // 0x0E18(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData45[0x68];                                      // 0x0E1C(0x0068) MISSED OFFSET
	unsigned char                                      IsHiddenUI : 1;                                           // 0x0E84(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData46 : 8;                                        // 0x0E85(0x0001)
	unsigned char                                      bWeaponCollision : 1;                                     // 0x0E85(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData47[0xA];                                       // 0x0E86(0x000A) MISSED OFFSET
	struct FScriptMulticastDelegate                    StateLeaveHandler;                                        // 0x0E90(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bMarkScopeLocDirty : 1;                                   // 0x0EA0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData48[0x7];                                       // 0x0EA1(0x0007) MISSED OFFSET
	struct FVector                                     LeanLeftTraceOffset;                                      // 0x0EA8(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    ServerControlRotation;                                    // 0x0EB4(0x000C) (BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnCharacterStopFireDelegate;                              // 0x0EC0(0x0010) (ZeroConstructor, InstancedReference)
	unsigned char                                      bHasStuckOperation : 1;                                   // 0x0ED0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData49[0x3];                                       // 0x0ED1(0x0003) MISSED OFFSET
	float                                              StandHalfHeight;                                          // 0x0ED4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData50[0x4];                                       // 0x0ED8(0x0004) MISSED OFFSET
	float                                              ScopeAimShootSpreadRotValMax;                             // 0x0EDC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData51[0x80];                                      // 0x0EE0(0x0080) MISSED OFFSET
	struct FVector                                     ScopeAimShootSpreadDir;                                   // 0x0F60(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData52[0x4];                                       // 0x0F6C(0x0004) MISSED OFFSET
	class UCapsuleComponent*                           ProneBoxComponent;                                        // 0x0F70(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      IsPressedWalk : 1;                                        // 0x0F78(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData53[0x7];                                       // 0x0F79(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCharacterAimModeChanged;                                // 0x0F80(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UAkAudioEvent*                               VariableZoomStepAk;                                       // 0x0F90(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bIsDrawLocation : 1;                                      // 0x0F98(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData54[0x7];                                       // 0x0F99(0x0007) MISSED OFFSET
	class USTBaseBuffSystemComponent*                  BuffSystemComponent;                                      // 0x0FA0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData55[0x8];                                       // 0x0FA8(0x0008) MISSED OFFSET
	unsigned char                                      bPeekLeftToggled : 1;                                     // 0x0FB0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData56 : 8;                                        // 0x0FB1(0x0001)
	unsigned char                                      bPeekRightToggled : 1;                                    // 0x0FB1(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData57[0x2];                                       // 0x0FB2(0x0002) MISSED OFFSET
	struct FVector_NetQuantizeNormal                   AimOffsets;                                               // 0x0FB4(0x000C) (Net, Transient)
	class UTslBreatheComp*                             BreatheComp;                                              // 0x0FC0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FKilledTipsBlock                            BlockData;                                                // 0x0FC8(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	class UAnimInstance*                               FPPAnimClass;                                             // 0x1000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData58[0x8];                                       // 0x1008(0x0008) MISSED OFFSET
	class UStaticMeshComponent*                        ScopComp;                                                 // 0x1010(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData59[0x8];                                       // 0x1018(0x0008) MISSED OFFSET
	class AController*                                 NetOwnerController;                                       // 0x1020(0x0008) (Net, Transient)
	class UInteractorComponent*                        InteractorComponent;                                      // 0x1028(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UCharacterInteractionComponent*              InteractionComponent;                                     // 0x1030(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      bIsHoldingAngled : 1;                                     // 0x1038(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData60[0x13];                                      // 0x1039(0x0013) MISSED OFFSET
	float                                              CapsuleTurnInterpSpeedLocomotion;                         // 0x104C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     NewProneHitBodyBoxScale;                                  // 0x1050(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData61[0x4];                                       // 0x105C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    StateInterruptedHandlerBP;                                // 0x1060(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData62[0x4];                                       // 0x1070(0x0004) MISSED OFFSET
	float                                              LeanOffset_Prone;                                         // 0x1074(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InteractAngleThreshold;                                   // 0x1078(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData63[0x4];                                       // 0x107C(0x0004) MISSED OFFSET
	class ASTExtraPlayerState*                         STExtraPlayerState;                                       // 0x1080(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     ScopeNewTargetLoc;                                        // 0x1088(0x000C) (BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData64[0x4];                                       // 0x1094(0x0004) MISSED OFFSET
	class ASTExtraBaseCharacter*                       WhoFollowMe;                                              // 0x1098(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<class ASTExtraPlayerController*>            MySpectators;                                             // 0x10A0(0x0010) (ZeroConstructor)
	float                                              WataerSurfaceZOffset;                                     // 0x10B0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData65[0x14];                                      // 0x10B4(0x0014) MISSED OFFSET
	class UPlayerSwimComponent*                        swimComponet;                                             // 0x10C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData66[0x10];                                      // 0x10D0(0x0010) MISSED OFFSET
	float                                              PreviousValueToSetForHealthPredict;                       // 0x10E0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData67[0x4];                                       // 0x10E4(0x0004) MISSED OFFSET
	class UPlayerGunCollosionComp*                     PlayerGunCollosionComp;                                   // 0x10E8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData68[0x18];                                      // 0x10F0(0x0018) MISSED OFFSET
	class UBaseCharacterPickupProxy*                   PickupProxy;                                              // 0x1108(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnPlayerPoseChange;                                       // 0x1110(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      bSwitchingToGrenade : 1;                                  // 0x1120(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData69 : 8;                                        // 0x1121(0x0001)
	unsigned char                                      bIsLastTwoCircle : 1;                                     // 0x1121(0x0001) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData70[0x2];                                       // 0x1122(0x0002) MISSED OFFSET
	float                                              BreathAmount;                                             // 0x1124(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	struct FBodyTypeDef                                DyingBodyDef;                                             // 0x1128(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData71[0x4];                                       // 0x1130(0x0004) MISSED OFFSET
	unsigned char                                      bDying : 1;                                               // 0x1134(0x0001) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData72[0x3];                                       // 0x1135(0x0003) MISSED OFFSET
	float                                              FarDistanceAimFOV;                                        // 0x1138(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              HealthPredict;                                            // 0x113C(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData73[0x10];                                      // 0x1140(0x0010) MISSED OFFSET
	float                                              SprintingSmallGunMOdifier;                                // 0x1150(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SprintingBigGunModifier;                                  // 0x1154(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SprintingRifleModifier;                                   // 0x1158(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BoostPhase3BuffSpeedModifier;                             // 0x115C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BoostPhase4BuffSpeedModifier;                             // 0x1160(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              HeavyFallMovementStopTime;                                // 0x1164(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              voiceCheckCD;                                             // 0x1168(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData74[0x4];                                       // 0x116C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnReloadEnd;                                              // 0x1170(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData75[0x8];                                       // 0x1180(0x0008) MISSED OFFSET
	class ASTExtraShootWeapon*                         AutoEquipWeaponTemplate;                                  // 0x1188(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bWeaponObstruct : 1;                                      // 0x1190(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData76[0x3];                                       // 0x1191(0x0003) MISSED OFFSET
	float                                              ScopeAimShootSpreadDirValMax;                             // 0x1194(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     ScopeNewIdleLoc;                                          // 0x1198(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	EInvincibleType                                    InvincibleType;                                           // 0x11A4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData77[0x3];                                       // 0x11A5(0x0003) MISSED OFFSET
	unsigned char                                      bShowName : 1;                                            // 0x11A8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      bShowDamageToOther : 1;                                   // 0x11A8(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData78[0x3];                                       // 0x11A9(0x0003) MISSED OFFSET
	int                                                IsEnableReportPlayerBehavior;                             // 0x11AC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              Money;                                                    // 0x11B0(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData79[0x4];                                       // 0x11B4(0x0004) MISSED OFFSET
	struct FName                                       HeadSocketName;                                           // 0x11B8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       LFootSocketName;                                          // 0x11C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       RFootSocketName;                                          // 0x11C8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData80[0xC];                                       // 0x11D0(0x000C) MISSED OFFSET
	unsigned char                                      CurrentWeaponZoomLevel;                                   // 0x11DC(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData81[0xB];                                       // 0x11DD(0x000B) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerWeaponChangeState;                                // 0x11E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TEnumAsByte<ESTEPoseState>                         PoseState;                                                // 0x11F8(0x0001) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData82[0x3];                                       // 0x11F9(0x0003) MISSED OFFSET
	float                                              WeaponMaxShowDis;                                         // 0x11FC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               SwitchSightSound;                                         // 0x1200(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData83[0x4];                                       // 0x1208(0x0004) MISSED OFFSET
	int                                                ServerSimulateStates;                                     // 0x120C(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData84[0x4];                                       // 0x1210(0x0004) MISSED OFFSET
	unsigned char                                      bPressedSprint : 1;                                       // 0x1214(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData85 : 8;                                        // 0x1215(0x0001)
	unsigned char                                      UseShootVerifyEx : 1;                                     // 0x1215(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData86[0x2];                                       // 0x1216(0x0002) MISSED OFFSET
	float                                              SwimableCharacterLengthOnSurface;                         // 0x1218(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData87[0x4];                                       // 0x121C(0x0004) MISSED OFFSET
	TArray<struct FWeaponSlotSwitchTimeData>           SwitchSlotTimeDataList;                                   // 0x1220(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	class USTCharacterFollowComp*                      AutoFollowComponent;                                      // 0x1230(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData88[0x8];                                       // 0x1238(0x0008) MISSED OFFSET
	class UTslPlayerDamageConfig*                      DamageConfig;                                             // 0x1240(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData89[0x8];                                       // 0x1248(0x0008) MISSED OFFSET
	struct FAnimParamList                              CurAnimParamList;                                         // 0x1250(0x00EC) (BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData90[0x4];                                       // 0x133C(0x0004) MISSED OFFSET
	class UCharacterAvatarComponent*                   AvatarComponent;                                          // 0x1340(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData91[0x4];                                       // 0x1348(0x0004) MISSED OFFSET
	unsigned char                                      bIsGunADS : 1;                                            // 0x134C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData92 : 8;                                        // 0x134D(0x0001)
	unsigned char                                      IsBeingRescued : 1;                                       // 0x134D(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData93[0x2];                                       // 0x134E(0x0002) MISSED OFFSET
	float                                              ScopeMoveInOutSpeed;                                      // 0x1350(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData94[0x4];                                       // 0x1354(0x0004) MISSED OFFSET
	float                                              ValueLimitForHealthPredict;                               // 0x1358(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      IsRescueingOther : 1;                                     // 0x135C(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData95[0x3];                                       // 0x135D(0x0003) MISSED OFFSET
	TMap<int, float>                                   CachedReticleBrightnessMap;                               // 0x1360(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData96[0x8];                                       // 0x13B0(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnWeaponFireModeChangeDelegate;                           // 0x13B8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDetachedFromVehicle;                                    // 0x13C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FBodyTypeDef                                ProneBodyDef;                                             // 0x13D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FScriptMulticastDelegate                    OnPlayerAttrChangeDelegate;                               // 0x13E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	int                                                HandFolderRatio;                                          // 0x13F0(0x0004) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EThrowGrenadeMode>                     ThrowGrenadeMode;                                         // 0x13F4(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData97[0x7];                                       // 0x13F5(0x0007) MISSED OFFSET
	int                                                IsEnableReportRoute;                                      // 0x13FC(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              maxShowAlpha;                                             // 0x1400(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      PeekHasCollision : 1;                                     // 0x1404(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData98[0x3];                                       // 0x1405(0x0003) MISSED OFFSET
	float                                              AutoScopeDelayTimeWhenPeek;                               // 0x1408(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData99[0x4];                                       // 0x140C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPlayerTeleport;                                         // 0x1410(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData100[0x18];                                     // 0x1420(0x0018) MISSED OFFSET
	struct FCharacterEnergyData                        Energy;                                                   // 0x1438(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly, Net)
	int                                                SkillPromptItemID;                                        // 0x1470(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      IsPeekLeft : 1;                                           // 0x1474(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData101[0x13];                                     // 0x1475(0x0013) MISSED OFFSET
	TMap<int, int>                                     CachedReticleShapeIndexMap;                               // 0x1488(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData102[0x8];                                      // 0x14D8(0x0008) MISSED OFFSET
	float                                              TurnInPlaceAngel;                                         // 0x14E0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData103[0x4];                                      // 0x14E4(0x0004) MISSED OFFSET
	struct FAnimStatusKeyList                          CurUpdateStatusKeyList;                                   // 0x14E8(0x0020)
	unsigned char                                      IsSwimUpWater : 1;                                        // 0x1508(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData104[0x3];                                      // 0x1509(0x0003) MISSED OFFSET
	struct FVector2D                                   DesiredInput;                                             // 0x150C(0x0008) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	float                                              DelayHideDuration;                                        // 0x1514(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData105[0x4];                                      // 0x1518(0x0004) MISSED OFFSET
	float                                              ProneHalfHeight;                                          // 0x151C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData106[0x8];                                      // 0x1520(0x0008) MISSED OFFSET
	class ASTExtraVehicleBase*                         LatestVehicle;                                            // 0x1528(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               MountAccessoriesSound;                                    // 0x1530(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData107[0x8];                                      // 0x1538(0x0008) MISSED OFFSET
	float                                              CapsuleTurnInterpSpeedLocomotionProne;                    // 0x1540(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData108[0x14];                                     // 0x1544(0x0014) MISSED OFFSET
	float                                              ExtremeFallMovementStopTime;                              // 0x1558(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData109[0x54];                                     // 0x155C(0x0054) MISSED OFFSET
	class USTCharacterMovementComponent*               STCharacterMovement;                                      // 0x15B0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      IsEnablePeek : 1;                                         // 0x15B8(0x0001) (ZeroConstructor, Config, IsPlainOldData)
	unsigned char                                      UnknownData110[0x17];                                     // 0x15B9(0x0017) MISSED OFFSET
	int                                                VehicleSeatIdx;                                           // 0x15D0(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData111[0x4];                                      // 0x15D4(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnBulletChange;                                           // 0x15D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData112[0x18];                                     // 0x15E8(0x0018) MISSED OFFSET
	float                                              FOV_OnScopingEaseExp;                                     // 0x1600(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData113[0x4];                                      // 0x1604(0x0004) MISSED OFFSET
	class UCurveFloat*                                 CameraFovRatioCurve;                                      // 0x1608(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveVector*                                Curve_FPPCameraOffsetByFOV;                               // 0x1610(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UCurveFloat*                                 AngledCurve;                                              // 0x1618(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimoffsetsLastRepTime;                                    // 0x1620(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData114[0x4];                                      // 0x1624(0x0004) MISSED OFFSET
	unsigned char                                      bNonLinearTurn : 1;                                       // 0x1628(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData115[0x7];                                      // 0x1629(0x0007) MISSED OFFSET
	class UTslEmoteComponent*                          EmoteComponent;                                           // 0x1630(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData116[0x4];                                      // 0x1638(0x0004) MISSED OFFSET
	float                                              PointDamageForce_MapMin;                                  // 0x163C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData117[0x4];                                      // 0x1640(0x0004) MISSED OFFSET
	unsigned char                                      bCheckRelevantWithFOV : 1;                                // 0x1644(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData118[0x13];                                     // 0x1645(0x0013) MISSED OFFSET
	struct FSoftClassPath                              AdaptiveCrosshairWidgetClass;                             // 0x1658(0x0018) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData119[0x50];                                     // 0x1670(0x0050) MISSED OFFSET
	float                                              TargetPlayerAIPolicyDecisionLogInterval;                  // 0x16C0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AimStateReturnTime;                                       // 0x16C4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class ASTExtraWeapon*                              CurrentReloadWeapon;                                      // 0x16C8(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnPreVaultClient;                                         // 0x16D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData120[0xC];                                      // 0x16E0(0x000C) MISSED OFFSET
	float                                              PointDamageForceMultiplier;                               // 0x16EC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData121[0x8];                                      // 0x16F0(0x0008) MISSED OFFSET
	unsigned char                                      bUseRagdoll : 1;                                          // 0x16F8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData122[0x3];                                      // 0x16F9(0x0003) MISSED OFFSET
	float                                              WaterFloorDetectionLength;                                // 0x16FC(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData123[0x8];                                      // 0x1700(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    StateEnterHandler;                                        // 0x1708(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
