

// Class ShadowTrackerExtra.STExtraShootWeapon
// //Class ShadowTrackerExtra.STExtraShootWeapon
//0x04E0 (0x0B70 - 0x0690)
class ASTExtraShootWeapon : public ASTExtraWeapon
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0690(0x0008) MISSED OFFSET
	unsigned char                                      bHasFinishConfirmedFromServer : 1;                        // 0x0698(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0699(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    StartReloadMagazineDelegate;                              // 0x06A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	EGunFireMode                                       InitialFireMode;                                          // 0x06B0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x06B1(0x0003) MISSED OFFSET
	float                                              SilenceVoiceCheckDis;                                     // 0x06B4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAttrModifyComponent*                        AttrModifierCompoment;                                    // 0x06B8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              nowVoiceCheckDis;                                         // 0x06C0(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x06C4(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    StartReloadByOneDelegate;                                 // 0x06C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FWeaponAttrModifyConfig>             WeaponAttrModifyConfigList;                               // 0x06D8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData04[0x8];                                       // 0x06E8(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnWeaponReloadEndDelegage;                                // 0x06F0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UStaticMeshComponent*                        DefaultGunstockComponent;                                 // 0x0700(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnWeaponEquipDelegate;                                    // 0x0708(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	EGunFireMode                                       FireMode;                                                 // 0x0718(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0719(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnShootWeaponAutoReloadDel;                               // 0x0720(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UTslBallisticsComp*                          TslBallisticsComp;                                        // 0x0730(0x0008) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	class UAkAudioEvent*                               MagazineINSound;                                          // 0x0738(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USTExtraShootWeaponComponent*                ShootWeaponComponent;                                     // 0x0740(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnWeaponShootHitDelegate;                                 // 0x0748(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UAkAudioEvent*                               ToggleFiringMode;                                         // 0x0758(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x8];                                       // 0x0760(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnChangeAvailableAmmoInBackpack;                          // 0x0768(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData07[0x8];                                       // 0x0778(0x0008) MISSED OFFSET
	struct FVector                                     BulletDecalScale;                                         // 0x0780(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x078C(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStopFireDelegate;                                       // 0x0790(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCurBulletChange;                                        // 0x07A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnWeaponReloadStartDelegate;                              // 0x07B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	int                                                CurBulletNumInClipOnSimulatedClients;                     // 0x07C0(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	int                                                CurrentZeroLevel;                                         // 0x07C4(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               MagazineOUTSound;                                         // 0x07C8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x78];                                      // 0x07D0(0x0078) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnStartFireDelegate;                                      // 0x0848(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData10[0x8];                                       // 0x0858(0x0008) MISSED OFFSET
	class UStaticMeshComponent*                        DefaultScopeComponent;                                    // 0x0860(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	float                                              LastImpactEffectTime;                                     // 0x0868(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData11[0x4];                                       // 0x086C(0x0004) MISSED OFFSET
	TArray<struct FMeshSynData>                        synData;                                                  // 0x0870(0x0010) (Net, ZeroConstructor, Transient)
	int                                                TotalFireMode;                                            // 0x0880(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData12[0xC];                                       // 0x0884(0x000C) MISSED OFFSET
	struct FName                                       MagTag;                                                   // 0x0890(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurBulletNumInBarrel;                                     // 0x0898(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EShootWeaponShootMode>                 ShootMode;                                                // 0x089C(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData13[0x3];                                       // 0x089D(0x0003) MISSED OFFSET
	int                                                ClientShootTimes;                                         // 0x08A0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData14[0x4];                                       // 0x08A4(0x0004) MISSED OFFSET
	class UShootWeaponEntity*                          ShootWeaponEntityComp;                                    // 0x08A8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAkAudioEvent*                               PullBoltSound;                                            // 0x08B0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurBulletNumInClip;                                       // 0x08B8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData15[0x4];                                       // 0x08BC(0x0004) MISSED OFFSET
	struct FName                                       PlayerMagTag;                                             // 0x08C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    OffsetFPPCrouchRotation;                                  // 0x08C8(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData16[0xC];                                       // 0x08D4(0x000C) MISSED OFFSET
	TEnumAsByte<ECollisionChannel>                     TraceChannel;                                             // 0x08E0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData17[0x3];                                       // 0x08E1(0x0003) MISSED OFFSET
	struct FRotator                                    OffsetFPPProneRotation;                                   // 0x08E4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData18[0x4];                                       // 0x08F0(0x0004) MISSED OFFSET
	struct FVector                                     OffsetFPPProneLocation;                                   // 0x08F4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bIsPistol : 1;                                            // 0x0900(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData19 : 8;                                        // 0x0901(0x0001)
	unsigned char                                      IsEquipFiringSuppressor : 1;                              // 0x0901(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData20[0x1E];                                      // 0x0902(0x001E) MISSED OFFSET
	struct FVector                                     OffsetFPPLocation;                                        // 0x0920(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              voiceCheckCD;                                             // 0x092C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurMaxBulletNumInOneClip;                                 // 0x0930(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LastImpactEffectLocation;                                 // 0x0934(0x000C) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData21[0x4];                                       // 0x0940(0x0004) MISSED OFFSET
	unsigned char                                      DefaultScopeVisiable : 1;                                 // 0x0944(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EShootWeaponState>                     CurShootWeaponState;                                      // 0x0945(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData22[0x12];                                      // 0x0946(0x0012) MISSED OFFSET
	struct FWeaponPPSettings                           WeaponGunPostprocessSettings;                             // 0x0958(0x00A8) (Edit, DisableEditOnInstance)
	class UAkAudioEvent*                               BulletFlySound;                                           // 0x0A00(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      bIsAIOwner : 1;                                           // 0x0A08(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData23[0x3];                                       // 0x0A09(0x0003) MISSED OFFSET
	struct FVector                                     ShootTargetLoc;                                           // 0x0A0C(0x000C) (BlueprintVisible, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnBulletNumChangeDelegate;                                // 0x0A18(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UReticlePostprocessData*                     ReticlePostprocessData;                                   // 0x0A28(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     OffsetFPPCrouchLocation;                                  // 0x0A30(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              VoiceCheckDis;                                            // 0x0A3C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UStaticMeshComponent*                        DefaultPlayerMagComponent;                                // 0x0A40(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData24[0x10];                                      // 0x0A48(0x0010) MISSED OFFSET
	struct FRotator                                    OffsetFPPScopeRotation;                                   // 0x0A58(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData25[0x4];                                       // 0x0A64(0x0004) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnWeaponSecurityLogShootActorDelegate;                    // 0x0A68(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FItemDefineID>                       AttachedAttachmentID;                                     // 0x0A78(0x0010) (Net, ZeroConstructor)
	unsigned char                                      UnknownData26[0x8];                                       // 0x0A88(0x0008) MISSED OFFSET
	struct FTransform                                  BoltActionTransform;                                      // 0x0A90(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	float                                              voiceCheckShowCD;                                         // 0x0AC0(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData27[0x4];                                       // 0x0AC4(0x0004) MISSED OFFSET
	class UStaticMeshComponent*                        DefaultGripComponent;                                     // 0x0AC8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      isDefaultSlienceWeapon : 1;                               // 0x0AD0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData28[0x7];                                       // 0x0AD1(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnWeaponShootDelegate;                                    // 0x0AD8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UStaticMesh*                                 DefaultMagMesh;                                           // 0x0AE8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               ChangeMagazineSound;                                      // 0x0AF0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAkAudioEvent*                               LoadBulletSound;                                          // 0x0AF8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurBurstShootIndex;                                       // 0x0B00(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData29[0x14];                                      // 0x0B04(0x0014) MISSED OFFSET
	EGunFireMode                                       PrevFireMode;                                             // 0x0B18(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      IsEquipCompensator : 1;                                   // 0x0B19(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData30[0x2];                                       // 0x0B1A(0x0002) MISSED OFFSET
	struct FRotator                                    OffsetFPPRotation;                                        // 0x0B1C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FBulletHitInfoUploadData>            HitDataArray;                                             // 0x0B28(0x0010) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor)
	class UStaticMeshComponent*                        DefaultMagComponent;                                      // 0x0B38(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      IsEquipSilencer : 1;                                      // 0x0B40(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData31[0x7];                                       // 0x0B41(0x0007) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnWeaponUnEquipDelegate;                                  // 0x0B48(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData32[0x18];                                      // 0x0B58(0x0018) MISSED OFFSET

	// Function ShadowTrackerExtra.STExtraShootWeapon.ZeroingLevelUp
	// (Final, Native, Public, BlueprintCallable)
	void ZeroingLevelUp();// sub_107BD70()

	// Function ShadowTrackerExtra.STExtraShootWeapon.ZeroingLevelDown
	// (Final, Native, Public, BlueprintCallable)
	void ZeroingLevelDown();// sub_107BD50()

	// Function ShadowTrackerExtra.STExtraShootWeapon.StopFireFilter
	// (Native, Event, Public, BlueprintEvent)
	unsigned char StopFireFilter();// sub_8C16A0()

	// Function ShadowTrackerExtra.STExtraShootWeapon.StopFire
	// (Native, Public, BlueprintCallable)
	void StopFire(TEnumAsByte<EFreshWeaponStateType> ToState);// sub_107BCD0()

	// DelegateFunction ShadowTrackerExtra.STExtraShootWeapon.StartReloadMagazine__DelegateSignature
	// (MulticastDelegate, Public, Delegate)
	void StartReloadMagazine__DelegateSignature(EWeaponReloadAnimExec AnimExec);// sub_1B0A820()

